{
  "hadiths": [
    {
      "number": 1,
      "title": "Niat",
      "arabicTitle": "",
      "imagePath": "assets/images/h1.jpg",
      "audioPath": "assets/audio/hadith1.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith1.png"
      ],
      "htmlDescription": "Dari Amirul Mukminin Umar Al-Khattab r.a katanya: \"Aku mendengar Rasulullah S.A.W. bersabda: \"Bahawasanya amalan-amalan itu adalah (bergantung) kepada niat, dan bahawasanya bagi setiap manusia itu apa (balasan) yang diniatkannya. Maka barangsiapa yang berhijrah kepada Allah dan RasulNya, maka hijrahnya itu adalah kepada Allah dan RasulNya. Dan barangsiapa yang berhijrah kerana dunia yang ingin ia memperolehinya atau kerana seorang perempuan yang ingin ia dinikahinya, maka hijrahnya itu adalah atas apa yang ia berhijrah kerananya.\"<br><br>(Riwayat al-Bukhari no.1, 54, 2529, 3898, 5070, 6689, 6953, Muslim no. 1907, Abu Daud no. 2201, al-Tirmizi no. 1646, al-Nasai`i no.1/59-60, VI/158, Ibn Majah no. 4227 dan Ahmad no. 1/25, 43)<br><br><br><strong>Catatan:</strong><br><br>Hadis ini merupakan salah satu hadis yang menjadi inti ajaran Islam. Imam Ahmad dan Imam Syafi’i berkata bahawa hadis tentang niat ini merangkumi sepertiga daripada ilmu. Ini kerana perbuatan manusia terdiri daripada tiga: hati, lisan, dan anggota badan, manakala niat adalah salah satu daripadanya. Diriwayatkan bahawa Imam Syafi’i berkata, hadis ini meliputi tujuh puluh bab dalam fiqh. Sesetengah ulama pula menyatakan bahawa hadis ini merupakan sepertiga daripada Islam.<br><br>Hadis ini juga mempunyai sebab turunnya. Diriwayatkan ada seseorang yang berhijrah dari Makkah ke Madinah bukan kerana Allah, tetapi untuk menikahi seorang wanita bernama “Ummu Qais”. Orang ini kemudian dikenali sebagai “Muhajir Ummu Qais” (orang yang berhijrah kerana Ummu Qais).<br><br>Oleh itu, hadis ini dianggap salah satu hadis utama dalam Islam.<br><br><strong>Pokok Perbincangan Hadis:</strong><br><br>Sebab keluar hadis: Kisah hijrah Ummu Qais.<br><br><strong>Kepentingan niat:</strong><br><br>Membezakan ibadah dengan adat.<br><br>Menentukan matlamat amal: adakah untuk Allah atau tujuan lain.<br><br><strong>Hukum melafazkan niat (jahr):</strong><br><br>Lafaz niat yang dibesar-besarkan (jahr) dianggap bid’ah dan tidak ditetapkan dalam Al-Quran atau sunnah.<br><br>Fuqaha Syafi’e menyatakan bahawa jahr dalam niat boleh mengganggu orang lain (contohnya dalam solat), jadi hukumnya tidak digalakkan.<br><br><strong>Kesan niat baik pada perkara yang harus:</strong><br><br>Perkara yang harus menjadi hampir dengan Allah jika diniatkan dengan niat baik.<br><br>Contohnya, memberi makan atau minum untuk tujuan ketaatan atau menunaikan hak anak/isteri dianggap ibadah.<br><br>Hubungan suami isteri (jima’) juga dikira ibadah jika diniatkan menunaikan hak pasangan.<br><br><strong>Langkah menjadikan perkara harus sebagai qurbah:</strong><br><br>Tidak boleh menjadikan perkara harus hanya kerana kelihatan luarannya sebagai ibadah.<br><br>Perkara yang mubah boleh dijadikan wasilah kepada ibadah jika ia selaras dengan syariat dan niatnya benar.<br><br>Ia harus dianggap sebagai sebahagian daripada ibadah (juz’ie), tetapi tidak boleh berlebihan sehingga membahayakan diri.<br><br><strong>Pengajaran Hadis:</strong><br><br>Niat adalah teras setiap amalan. Amalan baik mesti disertai niat yang baik.<br><br>Amalan yang dilakukan tanpa niat yang betul, walaupun baik, tidak membawa faedah.<br><br>Amalan baik yang diniatkan bukan kerana Allah (contohnya riya’, menunjuk-nunjuk, atau tujuan duniawi) tidak memberi pahala.<br><br>Ulama menyatakan bahawa amalan kecil boleh menjadi besar kerana niat, manakala amalan besar boleh menjadi kecil kerana niat. Setiap amalan dibalas berdasarkan niat pelakunya.<br><br>Hijrah adalah peristiwa penting dalam Islam. Sesiapa yang berhijrah kerana Allah dan Rasul-Nya, akan mendapat pahala besar. Sebaliknya, jika berhijrah kerana dunia atau perempuan, hanya mendapat apa yang diniatkannya.<br><br>Walaupun hijrah fizikal mungkin tiada lagi, hijrah dalam makna meninggalkan maksiat dan menuju ketaatan juga dianggap hijrah dan diberi ganjaran pahala."
    },
    {
      "number": 2,
      "title": "Iman, Islam dan Ihsan",
      "arabicTitle": "",
      "imagePath": "assets/images/h2.jpg",
      "audioPath": "assets/audio/hadith2.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith2.png",
        "assets/images/hadith2_2.png"
      ],
      "htmlDescription": "Daripada Saiyidina 'Umar juga, r.a. beliau berkata: Ketika kami sedang duduk di sisi Rasulullah SAW pada suatu hari, tiba-tiba muncul di hadapan kami seorang lelaki yang memakai pakaian yang sangat putih, berambut sangat hitam, yang tidak ternampak pada dirinya kesan-kesan tanda musafir dan tidak seorangpun di kalangan kami yang mengenalinya. Lalu dia duduk menghampiri Nabi SAW lalu disandarkan kedua-dua lututnya ke lutut Baginda dan meletakkan dua tapak tangannya atas dua paha Baginda seraya berkata: Wahai Muhammad! Terangkan kepadaku tentang Islam. Lalu Rasulullah SAW bersabda: Islam itu bahawa engkau naik saksi bahawa tiada Tuhan melainkan Allah dan bahawa Muhammad itu utusan Allah, (dan bahawa) engkau mendirikan sembahyang, mengeluarkan zakat, berpuasa di bulan Ramadhan, menunaikan haji ke BaitulLah (Mekah) sekiranya engkau berkuasa mengerjakannya. Lelaki tersebut berkata: Benarlah engkau. Maka kamipun merasa hairan kepadanya, dia yang bertanya dia pula yang membenarkannya. Dia bertanya: Terangkan kepadaku tentang Iman. Baginda bersabda: Iman itu ialah bahawa engkau percaya kepada Allah, para MalaikatNya, kitab-kitabNya, para RasulNya, hari Qiamat dan bahawa engkau percaya kepada Qadar baik dan buruk. Lelaki itu berkata: Benarlah engkau. Dia berkata lagi: Terangkanlah kepadaku tentang Ehsan. Baginda bersabda: Ehsan itu ialah bahawa engkau menyembah Allah seolah-olah engkau melihatNya. Sekiranya engkau tidak dapat melihatnya, maka sesungguhnya Dia melihatmu. Lelaki itu bertanya lagi: Terangkan kepadaku tentang Qiamat. Baginda bersabda: Orang yang ditanya tentang Qiamat tidaklah lebih mengetahui daripada orang yang bertanya. Lelaki itu berkata: Maka terangkanlah kepadaku tentang tanda-tandanya. Baginda bersabda: (Antara tandatandanya ialah) apabila seorang hamba perempuan melahirkan tuannya dan apabila engkau melihat orang-orang miskin yang berkaki ayam, tidak berpakaian dan papa kedana yang hanya menjadi pengembala kambing berlumba-lumba membina bangunan (iaitu bertukar menjadi kaya raya). Kemudian lelaki itu berlalu, lalu aku terdiam sebentar. Kemudian Baginda bertanya: Wahai 'Umar! Adakah engkau tahu siapa lelaki yang bertanya itu? Aku berkata: Allah dan RasulNya lebih mengetahui. Baginda bersabda: Sesungguhnya dia adalah Malaikat Jibril yang datang kepada kamu untuk mengajar kamu tentang agama kamu.<br><br>(Hadis riwayat al-Imam Muslim, kitab al-Iman, no: 9 dan 10, al-Tirmizi, kitab al-Iman, no:2535, beliau berkata: hadis ini hasan shahih, al-Nasaa'ie, kitab al-Iman, no: 4904, 4905, Abu Dawud, kitab al-Sunnah, no:4075, Ibn Majah, kitab al-Muqaddimah, no: 62 dan 63, Ahmad, musnad, no: 346).<br><br><strong>Pokok Perbincangan Hadis:</strong><br><br>Hadis ini dianggap sebagai ibu kepada hadis-hadis lain kerana ia mengandungi penjelasan agama secara menyeluruh.<br><br>Islam: merangkumi ibadat zahir, lisan, dan harta (ibadat badani, lisani, maali).<br><br>Iman: asas iman, termasuk iman dan Islam; perkataan dan amalan juga sebahagian daripada iman.<br><br>Membezakan antara sifat Allah dengan sifat makhluk.<br><br>Menunjukkan tanda-tanda kedatangan Hari Qiamat.<br><br>Menyentuh sifat-sifat Malaikat Jibril (Ruh Al-Amin).<br><br><strong>Pengajaran Hadis:</strong><br><br><strong>Asal-usul Agama Islam:</strong><br><br>Agama Islam adalah agama yang datang daripada Allah, disebut sebagai agama samawi atau bersifat Rabbani, iaitu bersumberkan wahyu dari langit yang disampaikan melalui Malaikat Jibril. Islam bukan ciptaan akal manusia yang terbatas, justeru ia sesuai untuk seluruh umat manusia pada setiap tempat dan zaman.<br><br><strong>Tiga Tunggak Agama:</strong><br><br>Hadis ini menerangkan tiga aspek penting dalam agama: Rukun Islam, Rukun Iman, dan Ihsan.<br><br><strong>Rukun Islam (5 perkara):</strong><br><br>Mengucap dua kalimah syahadah<br><br>Mendirikan solat lima waktu<br><br>Membayar zakat<br><br>Berpuasa di bulan Ramadan<br><br>Mengerjakan haji di Baitullahilharam<br><br><strong>Rukun Iman (6 perkara):</strong><br><br>Beriman kepada Allah<br><br>Beriman kepada malaikat<br><br>Beriman kepada kitab-kitab Allah<br><br>Beriman kepada rasul-rasul<br><br>Beriman kepada Hari Qiamat<br><br>Beriman dengan qada’ dan qadar, baik atau buruk datang daripada Allah<br><br><strong>Kesempurnaan Mukmin:</strong><br><br>Kesempurnaan seorang mukmin tercapai apabila dia menunaikan semua rukun Islam, melaksanakan tuntutan rukun iman, dan mengamalkan ihsan. Islam tidak lengkap jika hanya diambil dari aspek zahir atau batin sahaja. Kesempurnaan Islam hanya muncul apabila ia diamalkan secara menyeluruh.<br><br><strong>Ilmu dalam Islam:</strong><br><br>Ilmu agama mestilah dipelajari melalui guru dan panduan yang betul.<br><br>Ilmu tidak boleh diperoleh hanya melalui mimpi atau cara yang tidak sahih.<br><br>Seorang murid mesti beradab tinggi, seperti adab Malaikat Jibril ketika bertanya kepada Rasulullah SAW.<br><br>Seorang guru juga wajib beradab tinggi; hanya mengajar apa yang diketahui dan meninggalkan apa yang tidak tahu. Ini adalah tanda wara’ dan keilmuan.<br><br><strong>Hari Qiamat:</strong><br><br>Hari Qiamat adalah peristiwa besar yang termasuk dalam rukun iman.<br><br>Tiada seorang manusia pun yang mengetahui bila ia akan berlaku, termasuk Rasulullah SAW. Hanya Allah SWT yang mengetahui. Sesiapa yang mengaku tahu atau mengetahui ilmu ghaib adalah penipu.<br><br>Walaupun tarikh Qiamat tidak diketahui, ada beberapa tanda-tanda kecil yang menunjukkan ia hampir berlaku, antaranya:<br><br>Seorang ibu melahirkan tuannya sendiri, menjadi hamba kepada anaknya.<br><br>Orang miskin yang papa berubah menjadi kaya raya secara luar biasa."
    },
    {
      "number": 3,
      "title": "Rukun Islam",
      "arabicTitle": "",
      "imagePath": "assets/images/h3.jpg",
      "audioPath": "assets/audio/hadith3.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith3.png"
      ],
      "htmlDescription": "Daripada Abu Abdul Rahman Abdullah ibn 'Umar ibn al-Khatthab r.a. beliau berkata: Aku telah mendengar Rasulullah SAW bersabda: \"Islam itu terbina atas lima perkara: Naik saksi mengaku bahawa sesungguhnya tiada Tuhan melainkan Allah dan bahawa sesungguhnya Muhammad itu adalah Utusan Allah, Mendirikan sembahyang, mengeluarkan zakat, mengerjakan haji ke Baitullah dan menunaikan puasa pada bulan Ramadhan.\" (Riwayat al-Bukhari Kitab al-Iman no.8 dan Muslim Kitab al-Imam no. 16).<br><br><br><strong>Pokok Perbincangan Hadis</strong><br><br><strong>Binaan Islam:</strong> Islam diibaratkan seperti sebuah bangunan yang menyelamatkan manusia daripada kekufuran, melayakkannya ke syurga, dan menjauhkannya daripada neraka. Bangunan ini tegak dengan struktur yang kemas dan kukuh, disokong oleh asas-asas dan cabang-cabang yang jelas.<br><br><strong>Ikatan Antara Rukun-Rukun Islam:</strong><br><br>Sempurna iman bagi sesiapa yang menerimanya sepenuhnya.<br><br>Sesiapa yang menolak semua rukun Islam dianggap kafir.<br><br>Sesiapa yang menolak salah satu rukun dianggap bukan Muslim (ijma’).<br><br>Sesiapa yang menerima tetapi malas melaksanakan (kecuali syahadah) dikategorikan fasiq.<br><br>Sesiapa yang melaksanakan dan mengakuinya secara pura-pura adalah munafiq.<br><br><strong>Matlamat Ibadat:</strong><br><br>Syahadah: Syarat agar amalan lain diterima.<br><br>Solat: Penghubung antara hamba dan Tuhan; solat akan menjadi perkara pertama dihisab.<br><br>Zakat: Menyuburkan harta dan memberkati kehidupan; menyucikan jiwa.<br><br>Haji: Wajib bagi mereka yang mampu dan tidak boleh ditangguhkan. Haji Mabrur adalah sebaik-baik jihad.<br><br>Puasa: Menundukkan nafsu dan menjauhkan diri daripada maksiat; sebab untuk meningkat darjat di sisi Allah.<br><br><strong>Pengajaran Hadis:</strong><br><br>Hadis ini menerangkan lima rukun Islam dan mengumpamakan Islam sebagai sebuah bangunan dengan lima tiang utama. Tanpa lima tiang ini, Islam seseorang akan goyah dan runtuh. Ini menekankan bahawa setiap Muslim mesti menegakkan rukun Islam dengan ikhlas dan penuh tanggungjawab. Menegakkan rukun Islam membawa kesempurnaan, keteguhan, dan keindahan dalam agama, manakala kecuaian akan mengakibatkan keruntuhan dan kehancuran."
    },
    {
      "number": 4,
      "title": "Manusia Awal dan Akhirnya",
      "arabicTitle": "",
      "imagePath": "assets/images/h4.jpg",
      "audioPath": "assets/audio/hadith4.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith4.png"
      ],
      "htmlDescription": "Daripada Abu Abdul Rahman Abdullah ibn Mas'uud r.a. beliau berkata: Rasulullah SAW telah bersabda, dan Baginda adalah seorang yang benar lagi dibenarkan (iaitu dipercayai): Sesungguhnya setiap orang di kalangan kamu dihimpunkan kejadiannya dalam perut ibunya selama 40 hari berupa air mani, kemudian menjadi segumpal darah selama tempoh yang sama, kemudian menjadi seketul daging selama tempoh yang sama, kemudian dikirimkan kepadanya seorang malaikat lalu dia menghembuskan padanya ruh dan dia diperintahkan dengan 4 kalimat; iaitu supaya menulis rezekinya, ajalnya, amalannya dan adakah dia celaka atau bahagia. Demi Allah Yang tiada Tuhan melainkanNya, sesungguhnya salah seorang dari kalangan kamu akan beramal dengan amalan ahli syurga, sehingga jarak antaranya dan syurga tidak lebih dari sehasta, lalu dia didahului oleh ketentuan tulisan kitab lantas dia mengerjakan amalan ahli neraka lalu dia memasuki neraka. Dan sesungguhnya salah seorang dari kalangan kamu akan beramal dengan amalan ahli neraka, sehingga jarak antaranya dengan neraka tidak lebih dari sehasta, lalu dia didahului oleh ketentuan tulisan kitab lantas dia mengerjakan amalan ahli syurga lalu dia memasuki syurga.<br><br>(Riwayat al-Bukhari no. 3208 dan Muslim no. 2643(1)).<br><br><br><strong>Kefahaman Hadis:</strong><br><br><strong>Peringkat Pertumbuhan Janin dalam Rahim:</strong><br><br>Al-Qur’an menerangkan tentang peringkat-peringkat kejadian manusia di dalam rahim melalui ayat-ayat seperti Al-Haj: 5 dan Al-Mu’minun: 12-14. Hikmah kejadian secara berperingkat ini adalah sebagai pengajaran kepada manusia bahawa untuk mencapai kesempurnaan dari segi rohani dan akhlak, ia mestilah melalui proses secara beransur-ansur (tadarruj), bukan secara tergesa-gesa atau gelojoh.<br><br><strong>Ditiupkan Ruh:</strong><br><br>Ulama’ sepakat bahawa ruh akan ditiupkan ke dalam janin selepas 120 hari dari tarikh persenyawaan. Hikmahnya termasuk bagi wanita yang kematian suami, tempoh iddahnya selama empat bulan sepuluh hari, supaya rahimnya tidak mengandung semula pada waktu tersebut.<br><br><strong>Pengguguran Janin:</strong><br><br>Ulama’ sepakat bahawa pengguguran janin adalah haram jika ruh sudah ditiupkan. Ia dianggap sebagai satu jenayah dan wajib membayar diat (denda), walaupun janin mati selepas itu. Pengguguran sebelum ditiupkan ruh juga haram menurut kebanyakan pendapat, walaupun ada sebahagian pendapat yang lemah membenarkannya.<br><br><strong>Keluasan Ilmu Allah:</strong><br><br>Allah SWT Maha Mengetahui segala keadaan makhluk-Nya sebelum mereka diciptakan, sama ada akan beriman dan taat, atau kufur dan bermaksiat, serta sama ada akan bahagia atau sengsara. Pengetahuan Allah tidak menghalang manusia daripada berikhtiar atau berusaha (Al-Syams: 7-10).<br><br><strong>Pengajaran Hadis:</strong><br><br>Kejadian manusia yang unik menunjukkan kekuasaan Allah SWT dalam mencipta makhluk-Nya. Ia menjadi bukti bahawa hanya Allah yang berhak disembah. Kejadian manusia mesti menjadi renungan bagi manusia yang berakal kerana keindahannya tiada tolok banding. Manusia tidak mampu mencipta manusia atau robot yang hidup dan mempunyai akal fikiran sendiri.<br><br>Proses kejadian manusia secara berperingkat telah diterangkan dalam al-Qur’an dan hadis Nabi sejak 14 kurun yang lalu. Namun, manusia hanya benar-benar memahami proses ini pada zaman moden melalui kemajuan sains. Ini jelas menunjukkan bahawa Allah SWT yang mencipta makhluk-Nya dan Dia Maha Mengetahui segala rahsia kejadian mereka.<br><br>Empat ketentuan hidup manusia telah ditetapkan Allah SWT sebelum dia lahir ke dunia, iaitu: rezekinya, ajal kematiannya, amalannya, dan nasibnya sama ada akan hidup senang atau susah.<br><br>Amalan terakhir manusia adalah penentu nasibnya di akhirat. Seseorang mungkin sepanjang hayatnya berbuat baik, tetapi jika di saat akhir dia melakukan maksiat, dia akan menerima balasan neraka. Begitulah sebaliknya, jika amalan terakhirnya baik, ia menentukan nasibnya yang kekal di syurga."
    },
    {
      "number": 5,
      "title": "Bida'ah",
      "arabicTitle": "",
      "imagePath": "assets/images/h5.jpg",
      "audioPath": "assets/audio/hadith5.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith5.png"
      ],
      "htmlDescription": "Daripada Ummu al-Mukminin Ummu Abdullah 'Aisyah r.a. beliau berkata: Rasulullah SAW telah bersabda: \"Barangsiapa yang mengada-adakan sesuatu perkara yang baru (bidaah) dalam urusan (agama) kami ini, amalan yang bukan bahagian daripadanya, maka ia tertolak.\"<br><br>(Riwayat al-Bukhari no. 2550, Muslim no. 4589 dan Abu Daud no. 4608).<br><br>Dalam riwayat Muslim, ada hadis lain berbunyi: \"Barangsiapa yang mengerjakan suatu amalan yang tidak ada asal usul dengan agama kita, maka ia tertolak.\"<br><br><strong>Pokok Perbincangan Hadis:</strong> <strong>Larangan Mengada-adakan Dalam Urusan Agama</strong><br><br><strong>a) Dalam Ibadat:</strong><br><br>Sesuatu amalan yang dibolehkan dalam ibadat tertentu, tidak semestinya boleh dilakukan dalam ibadat lain. Contohnya: membuka kepala ketika ihram atau cara berdiri tertentu ketika azan.<br><br>Ibadat yang langsung tidak disyariatkan, seperti hiburan atau tarian, tidak diterima Allah bahkan boleh menutup pintu taubatnya.<br><br>Menambah atau menokok tambah dalam ibadat yang telah disyariatkan, contohnya menambah rakaat dalam solat fardhu atau menambah bilangan wuduk, adalah tidak dibenarkan.<br><br>Mengurangkan atau meninggalkan sebahagian daripada ibadat yang disyariatkan, contohnya kurang rakaat dalam solat, juga tidak dibenarkan.<br><br><strong>b) Dalam Muamalat</strong> (Urusan Perdagangan dan Perjanjian):<br><br>i) ‘Aqad yang dilarang oleh syara’, contohnya perkahwinan dengan mahram.<br><br>ii) ‘Aqad pada barangan yang diharamkan’, contohnya jual beli arak atau bangkai.<br><br>iii) ‘Aqad yang menyebabkan berlaku kezaliman terhadap satu pihak’, contohnya menikahkan anak perempuan tanpa izinnya.<br><br><strong>Pengajaran Hadis</strong><br><br>Islam adalah agama yang sempurna dari segi dasar dan prinsip, dan tidak memerlukan sebarang penambahan.<br><br>Sebarang penambahan, pengubahsuaian atau pengurangan yang bertentangan dengan ajaran agama adalah bid’ah, yang diharamkan, ditolak, dan sesat.<br><br>Bid’ah bermaksud segala amalan yang tidak berpandukan ajaran agama, seperti mencipta cara sembahyang baru atau upacara keagamaan baru yang tiada asas dalam syariat.<br><br>Setiap Muslim perlu menjauhkan diri daripada perbuatan bid’ah yang sesat kerana ia boleh membawa kepada kerosakan diri, agama, dan ada yang boleh menyebabkan kufur.<br><br>Cukuplah bagi seorang Muslim berpegang teguh kepada ajaran yang dibawa oleh Rasulullah SAW demi menjamin kesejahteraan agama dan kehidupannya."
    },
    {
      "number": 6,
      "title": "Halal dan Haram",
      "arabicTitle": "",
      "imagePath": "assets/images/h6.jpg",
      "audioPath": "assets/audio/hadith6.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith6.png"
      ],
      "htmlDescription": "Daripada Abu Abdullah al-Nu'man ibn Basyer r.a. beliau berkata: Aku telah mendengar Rasulullah SAW bersabda: \"Sesungguhnya perkara yang halal itu terang jelas, dan sesungguhnya perkara yang haram itu terang jelas, dan di antara kedua perkara tersebut ada perkara-perkara syubhat yang kesamaran yang kebanyakan orang tidak mengetahuinya. Barangsiapa yang menjaga perkara syubhat maka sesungguhnya dia telah membersihkan agamanya dan maruah dirinya. Dan barangsiapa yang terjatuh dalam perkara syubhat, maka dia telah jatuh dalam perkara haram, umpama seorang pengembala yang mengembala di sekeliling kawasan larangan, dibimbangi dia akan menceroboh masuk ke dalamnya. Ketahuilah bahawa setiap raja ada sempadan dan sesungguhnya sempadan Allah itu ialah perkara yang diharamkanNya. Ketahuilah bahawa dalam setiap jasad itu ada seketul daging yang apabila ia baik maka baiklah seluruh jasad dan apabila ia rosak, maka rosaklah seluruh jasad. Ketahuilah ia adalah hati.\"<br><br>(Riwayat al-Bukhari no.52, Muslim no.1599 dan Abu Daud no.3329,3330).<br><br><br><strong>Catatan:</strong><br><br>Hadis ini merupakan salah satu landasan utama dalam syari’at Islam. Abu Daud menyatakan bahawa Islam berpandukan empat hadis, dan hadis ini termasuk salah satunya.<br><br><strong>Pengajaran yang Terdapat dalam Hadis:</strong><br><br>Sikap wara’ ditunjukkan dengan meninggalkan perkara-perkara syubhah (yang samar-samar hukumnya).<br><br>Sering melakukan perkara syubhah boleh menjerumuskan seseorang kepada perbuatan haram.<br><br>Menjauhi dosa kecil penting kerana ia boleh membawa kepada dosa besar.<br><br>Memberi perhatian kepada keadaan hati, kerana hati adalah punca tingkah laku seseorang.<br><br>Kebaikan amal anggota badan mencerminkan kebaikan hati.<br><br>Ketakwaan seseorang boleh dilihat apabila dia meninggalkan perkara syubhah kerana bimbang terjerumus kepada yang haram.<br><br>Berusaha menutup pintu peluang yang boleh membawa kepada perbuatan haram.<br><br>Berhati-hati dalam soal agama dan kehormatan diri serta mengelak perbuatan yang boleh menimbulkan prasangka buruk."
    },
    {
      "number": 7,
      "title": "Agama itu Nasihat",
      "arabicTitle": "",
      "imagePath": "assets/images/h7.jpg",
      "audioPath": "assets/audio/hadith7.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith7.png"
      ],
      "htmlDescription": "Daripada Abu Ruqaiyyah Tamim ibn Aus al-Daarie r.a. bahawa Nabi SAW telah bersabda: \"Agama itu adalah nasihat. Kami berkata: Untuk siapa? Baginda bersabda: Untuk Allah, untuk kitabNya, untuk RasulNya, untuk para imam kaum muslimin dan untuk umat Islam seluruhnya.\"<br><br>(Riwayat Ahmad no. 16982, Muslim no. 55 dan Abu Daud no. 4944).<br><br><br><strong>Pelajaran:</strong><br><br>Agama itu nasihat bermaksud bahawa nasihat adalah salah satu tiang agama. Oleh itu, setiap Muslim harus sentiasa saling menasihati antara satu sama lain.<br><br>Memberi nasihat wajib dilakukan mengikut kemampuan masing-masing."
    },
    {
      "number": 8,
      "title": "Kehormatan Muslim",
      "arabicTitle": "",
      "imagePath": "assets/images/h8.jpg",
      "audioPath": "assets/audio/hadith8.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith8.png"
      ],
      "htmlDescription": "Daripada lbnu 'Umar r.a. bahawa Rasulullah SAW telah bersabda: \"Aku telah diperintahkan supaya memerangi manusia sehingga mereka naik saksi bahawa sesungguhnya tiada Tuhan melainkan Allah dan bahawa sesungguhnya Muhammad utusan Allah, sehingga mereka mendirikan sembahyang dan membayar zakat. Apabila mereka telah berbuat demikian, maka mereka telah memelihara darah mereka dan harta mereka daripada aku, melainkan dengan hak Islam, dan hisab perhitungan amal mereka terserah kepada Allah Ta'ala.\"<br><br>(Riwayat al-Bukhari no.25, Muslim no.22 dan Ahmad no. 68).<br><br><br><strong>Pelajaran yang terdapat dalam hadis:</strong><br><br>Pemerintah dibolehkan memerangi orang yang enggan membayar zakat.<br><br>Diperbolehkan membunuh orang yang mengingkari solat dan memerangi mereka yang menolak membayar zakat.<br><br>Tidak dibenarkan berlaku sewenang-wenang terhadap harta dan nyawa kaum Muslimin.<br><br>Hukuman mati dibolehkan bagi seorang Muslim jika melakukan perbuatan yang menuntut hukuman tersebut, seperti:<br><br>Berzina bagi orang yang sudah menikah (muhshan).<br><br>Membunuh orang lain dengan sengaja.<br><br>Meninggalkan agama dan jemaahnya (murtad).<br><br>Hadis ini memberikan jawaban bagi kalangan murji’ah yang beranggapan bahawa iman tidak memerlukan amal perbuatan.<br><br>Tidak mengkafirkan pelaku bid’ah yang tetap menyatakan keesaan Allah dan menjalankan syari’at-Nya.<br><br>Terdapat dalil bahawa amal zahir diterima dan dihukum berdasarkan yang zahir, sementara yang tersembunyi adalah hak Allah untuk menentukannya."
    },
    {
      "number": 9,
      "title": "Perintah dan Larangan",
      "arabicTitle": "",
      "imagePath": "assets/images/h9.jpg",
      "audioPath": "assets/audio/hadith9.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith9.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah Abdul Rahman ibn Sokhrin r.a. beliau berkata: Aku telah mendengar Rasulullah SAW bersabda: \"Apa-apa yang aku larang kamu melakukannya, maka hendaklah kamu menjauhinya, dan apa-apa yang aku perintahkan kamu melakukannya, maka lakukanlah seberapa daya kamu. Sesungguhnya umat yang terdahulu daripada kamu telah binasa lantaran banyak persoalan dan banyak perselisihan mereka terhadap Nabi-nabi mereka.\"<br><br>(Riwayat al-Bukhari, no. 6777 dan Muslim, no. 1337).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Wajib menghindari semua perkara yang dilarang oleh Rasulullah SAW.<br><br>Bagi orang yang tidak mampu melaksanakan perintah secara keseluruhan, hendaklah melaksanakan apa yang mampu sahaja.<br><br>Allah tidak akan membebankan seseorang melainkan sesuai dengan kemampuannya.<br><br>Perkara yang mudah tidak gugur hanya kerana wujud perkara yang sukar.<br><br>Menolak keburukan lebih diutamakan daripada sekadar mendatangkan kemaslahatan.<br><br>Dilarang bertikai dan dianjurkan bersatu serta bersepakat.<br><br>Sesuatu yang dibiarkan diam merupakan rahmat, maka jangan bertanyakan secara berlebihan, seperti firman Allah yang bermaksud:<br><br>“Wahai orang yang beriman! Janganlah kamu bertanya tentang sesuatu yang jika dijelaskan kepada kamu, akan menyusahkan kamu.” (Surah al-Maidah: 5)"
    },
    {
      "number": 10,
      "title": "Rezeki yang Halal serta Doa yang Diterima",
      "arabicTitle": "",
      "imagePath": "assets/images/h10.jpg",
      "audioPath": "assets/audio/hadith10.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith10.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a beliau berkata: Rasulullah SAW telah bersabda: \"Sesungguhnya Allah Ta'ala baik, Dia tidak menerima kecuali perkara yang baik. Dan sesungguhnya Allah telah memerintahkan orang-orang mukmin dengan apa yang telah diperintahkan kepada para Rasul di mana Allah Ta'ala berfirman: (Wahai para Rasul! Makan minumlah kamu makanan yang baik-baik dan hendaklah kamu beramal soleh). (Surah al-Mukminun 23:51). Dan Allah Ta'ala berfirman: (Wahai orang-orang yang beriman! Makan minumlah kamu makanan yang baik-baik yang Kami rezekikan kepada kamu).(Surah al-Baqarah 2:172). Kemudian Baginda menyebut perihal seorang lelaki yang bermusafir jauh, yang berambut kusut masai dan berdebu, yang menadah tangan ke langit (iaitu berdoa): Wahai Tuhanku! Wahai Tuhanku! Bagaimanakah doanya akan dimakbulkan sedangkan makanannya haram, minumannya haram, pakaiannya haram dan dia dikenyangkan dengan makanan yang haram?\"<br><br>(Riwayat Ahmad no. 8348, Muslim no. 1015 dan al-Tirmizi no. 2922).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Hadis ini mengajar bahawa Allah Ta’ala suci daripada segala kekurangan dan cela.<br><br>Allah hanya menerima sesuatu yang baik, maka sedekah dari harta haram tidak akan diterima.<br><br>Sesuatu yang dikategorikan sebagai baik adalah apa yang dinilai baik di sisi Allah Ta’ala.<br><br>Berterusan melakukan perbuatan haram boleh menghalang terkabulnya doa.<br><br>Orang yang melakukan maksiat tidak termasuk golongan yang doanya dikabulkan, kecuali atas kehendak Allah.<br><br>Memakan barang haram boleh merosakkan amalan dan menjadi penghalang diterimanya amal ibadah.<br><br>Dianjurkan untuk berinfaq dari harta yang halal dan dilarang berinfaq dari yang haram.<br><br>Seorang hamba akan diberi ganjaran jika memakan yang baik dengan niat agar dirinya mendapat kekuatan untuk taat kepada Allah.<br><br>Doa orang yang sedang musafir dan yang hatinya penuh pengharapan akan terkabul.<br><br>Antara sebab dikabulkan doa:<br><br>Sedang bermusafir.<br><br>Hati yang sangat berharap.<br><br>Keadaan bersahaja ketika berdoa.<br><br>Mengangkat kedua-dua tangan ke langit.<br><br>Merayu dalam doa.<br><br>Menjaga makan dan minum daripada sumber halal.<br><br>Memakai pakaian halal."
    },
    {
      "number": 11,
      "title": "Tinggalkanlah Keraguan",
      "arabicTitle": "",
      "imagePath": "assets/images/h11.jpg",
      "audioPath": "assets/audio/hadith11.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith11.png"
      ],
      "htmlDescription": "Daripada Abu Muhammad al-Hasan ibn Ali ibn Abu Talib r.a., cucu Rasulullah SAW dan orang kesayangan Baginda. Beliau berkata: Aku telah menghafal daripada Rasulullah SAW hadis: \"Tinggalkanlah apa yang meragukan engkau kepada apa yang tidak meragukan engkau.\"<br><br>(Riwayat al-Tirmizi no. 2518, al-Nasa’i no. 5711, 8/327-328, Ibn Hibban dan al-Hakim).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Meninggalkan perkara syubhah dan memilih yang halal akan melahirkan sikap wara’.<br><br>Mengikuti pendapat ulama yang jelas dan selamat lebih utama, kerana ia menghindarkan daripada perkara syubhah, terutamanya jika pendapat lain kurang kukuh.<br><br>Jika keraguan bertentangan dengan keyakinan, maka keyakinan yang dipegang.<br><br>Sesuatu perkara harus didasarkan pada keyakinan dan ketenangan, kerana keraguan dan kebimbangan tidak memberi nilai.<br><br>Berhati-hati terhadap sikap meremehkan urusan agama dan masalah bid’ah.<br><br>Sesiapa yang membiasakan perkara syubhah, lama-kelamaan akan berani melakukan perbuatan haram."
    },
    {
      "number": 12,
      "title": "Tinggalkanlah apa yang tidak bermanfaat",
      "arabicTitle": "",
      "imagePath": "assets/images/h12.jpg",
      "audioPath": "assets/audio/hadith12.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith12.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a beliau berkata: Rasulullah SAW telah bersabda: \"Sebahagian daripada keelokan seorang mukmin ialah meninggalkan apa yang tidak berfaedah baginya.\"<br><br>(Riwayat al-Tirmizi no. 2318, Ibn Majah no. 3976, Ahmad no. 1732 dan al-Baihaqi).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Salah satu sifat seorang Muslim ialah menyibukkan diri dengan perkara yang mulia dan menjauhi perkara yang hina atau rendah moral.<br><br>Mendidik diri dan merawat hati dengan meninggalkan perkara-perkara yang tidak bermanfaat.<br><br>Menyibukkan diri dengan perkara yang tidak bermanfaat adalah sia-sia dan menunjukkan kelemahan iman.<br><br>Dianjurkan untuk memanfaatkan masa dengan perkara yang memberi manfaat bagi diri sendiri, sama ada untuk dunia atau akhirat.<br><br>Ikut campur dalam urusan orang lain yang bukan tanggungjawabnya boleh menyebabkan perpecahan dan pertikaian antara manusia."
    },
    {
      "number": 13,
      "title": "Kasih mengasihi sesama Islam",
      "arabicTitle": "",
      "imagePath": "assets/images/h13.jpg",
      "audioPath": "assets/audio/hadith13.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith13.png"
      ],
      "htmlDescription": "Daripada Abu Hamzah Anas ibn Malik r.a., khadam Rasulullah SAW, daripada Nabi SAW, Baginda bersabda: \"Seseorang kamu tidak benar-benar beriman sehingga dia mengasihi saudaranya sebagaimana dia mengasihi dirinya sendiri.\"<br><br>(Riwayat al-Bukhari no.13, Muslim no.45 dan Ahmad no. 18076).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Seorang mu’min dengan mu’min yang lain bagaikan satu jiwa; jika dia mencintai saudaranya, seakan-akan mencintai dirinya sendiri.<br><br>Menjauhi perbuatan hasad (dengki) kerana ia bertentangan dengan kesempurnaan iman.<br><br>Iman boleh bertambah dan berkurang; bertambah melalui ketaatan dan berkurang melalui kemaksiatan.<br><br>Dianjurkan untuk bersatu hati sesama umat Islam dan mengekalkan keharmonian."
    },
    {
      "number": 14,
      "title": "Larangan berzina, Membunuh dan Murtad",
      "arabicTitle": "",
      "imagePath": "assets/images/h14.jpg",
      "audioPath": "assets/audio/hadith14.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith14.png"
      ],
      "htmlDescription": "Daripada lbnu Mas'uud r.a. beliau berkata: Rasulullah SAW telah bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahawa tidak ada yang disembah melainkan Allah dan aku adalah utusan Allah kecuali kerana salah satu daripada tiga perkara: Berzina, padahal dia sudah berkahwin, membunuh orang dan meninggalkan agamanya serta memisahkan diri daripada jemaah (murtad).\"<br><br>(Riwayat al-Bukhari, dan Muslim).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Darah kaum Muslimin tidak boleh ditumpahkan kecuali dalam tiga keadaan:<br><br>Zina muhsan (orang yang sudah berkahwin).<br><br>Membunuh manusia dengan sengaja.<br><br>Murtad (meninggalkan agama dan berpisah dari jemaah kaum Muslimin).<br><br>Islam sangat menjaga kehormatan, nyawa, dan agama, dengan menjatuhkan hukuman berat bagi yang mengganggunya, seperti zina, pembunuhan, dan murtad.<br><br>Agama yang disepakati oleh jemaah kaum Muslimin wajib dijaga dan tidak boleh ditinggalkan.<br><br>Hukum jenayah dalam Islam sangat tegas untuk tujuan pencegahan dan perlindungan masyarakat.<br><br>Hukuman ini juga berfungsi sebagai pendidikan, supaya manusia takut kepada Allah Ta’ala dan sentiasa merasa diawasi, sama ada dalam keadaan tersembunyi atau terbuka.<br><br>Hadis ini menekankan pentingnya menjaga kehormatan dan kesucian diri, keluarga, dan masyarakat.<br><br>Terdapat ancaman (peringatan) bagi sesiapa yang membunuh manusia yang diharamkan oleh Allah Ta’ala."
    },
    {
      "number": 15,
      "title": "Adab Orang Mukmin",
      "arabicTitle": "",
      "imagePath": "assets/images/h15.jpg",
      "audioPath": "assets/audio/hadith15.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith15.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a., bahawa Rasulullah SAW telah bersabda: \"Barangsiapa yang beriman dengan Allah dan hari akhirat, maka hendaklah dia berkata baik atau dia diam. Barangsiapa yang beriman dengan Allah dan hari akhirat, maka hendaklah dia memuliakan jiran tetangganya. Barangsiapa yang beriman dengan Allah dan hari akhirat, maka hendaklah dia memuliakan tetamunya.\"<br><br>(Riwayat al-Bukhari, no. 5672 dan Muslim, no. 47).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Iman berkait secara langsung dengan kehidupan seharian, bukan hanya ibadah ritual.<br><br>Islam menyeru kepada tindakan yang menumbuhkan cinta dan kasih sayang di kalangan individu dalam masyarakat Muslim.<br><br>Termasuk dalam kesempurnaan iman adalah berkata perkataan yang baik dan diam daripada yang tidak baik.<br><br>Berlebih-lebihan dalam bercakap boleh membawa kepada kehancuran, manakala menjaga pembicaraan adalah jalan keselamatan.<br><br>Islam menekankan agar seorang Muslim berkata yang bermanfaat dan menjauhi perkataan yang dilarang dalam semua keadaan.<br><br>Jangan berlebihan ketika bercakap, kerana ia boleh menyeret kepada perbuatan haram atau makruh.<br><br>Kesempurnaan iman juga termasuk menghormati tetangga, memperhatikan harta mereka, membantu, dan tidak menyakiti mereka.<br><br>Berbicara wajib apabila perlu, terutamanya untuk menerangkan yang benar (haq) dan beramar ma’ruf nahi munkar.<br><br>Memuliakan tetamu adalah tanda kemuliaan akhlak dan komitmen terhadap syariat Islam. Rasulullah SAW bersabda:<br><br>“Menjamu tamu sehari semalam adalah kewajiban bagi setiap Muslim.”<br><br>Dianjurkan untuk melayani orang lain dengan baik dan bersikap sopan."
    },
    {
      "number": 16,
      "title": "Jangan Marah",
      "arabicTitle": "",
      "imagePath": "assets/images/h16.jpg",
      "audioPath": "assets/audio/hadith16.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith16.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a.: Bahawa seorang lelaki berkata kepada Nabi SAW: \"Berikan daku wasiat.\" Baginda bersabda: \"Janganlah engkau marah.\" Lelaki itu mengulangi soalan itu beberapa kali. Baginda tetap bersabda: \"Janganlah engkau marah.\"<br><br>(Riwayat Ahmad no. 8729, al-Bukhari no. 5765 dan al-Tirmizi no. 2020).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Setiap Muslim dianjurkan untuk memberikan nasihat, mengenal perbuatan kebajikan, menambah ilmu bermanfaat, dan menyampaikan nasihat yang baik.<br><br>Nabi Muhammad SAW bersabda:<br><br>“Sesiapa yang menahan marahnya padahal dia boleh melepaskannya, kelak Allah akan memanggilnya pada hari kiamat di hadapan segala makhluk, sehingga dia diberi hak memilih bidadari yang disukainya.”<br><br>Nabi Muhammad SAW juga bersabda:<br><br>“Orang yang kuat bukanlah yang mampu menumbangkan lawannya, tetapi orang kuat ialah yang mampu mengendalikan hawa nafsunya ketika marah.”<br><br>Langkah menghadapi kemarahan:<br><br>Jauhi akhlak tercela dan didik diri dengan akhlak mulia.<br><br>Berlatih memaafkan orang lain.<br><br>Bersikap tawaduk (rendah hati).<br><br>Mengucapkan ta’awwuz (memohon perlindungan kepada Allah daripada syaitan).<br><br>Mengubah posisi ketika marah: dari berdiri ke duduk, atau dari duduk ke berbaring.<br><br>Berhenti bercakap ketika marah.<br><br>Mengambil wuduk untuk menenangkan diri."
    },
    {
      "number": 17,
      "title": "Berbuat Baik Dalam Semua Urusan",
      "arabicTitle": "",
      "imagePath": "assets/images/h17.jpg",
      "audioPath": "assets/audio/hadith17.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith17.png"
      ],
      "htmlDescription": "Daripada Abu Ya'la Syaddad ibn Aus r.a. daripada Rasulullah SAW, bahawa Baginda bersabda: \"Sesungguhnya Allah menulis (iaitu mewajibkan) Ehsan atas segala sesuatu. Apabila kamu mahu membunuh, maka perelokkanlah pembunuhan itu. Apabila kamu mahu menyembelih, maka perelokkanlah penyembelihan itu dan hendaklah kamu menajamkan mata pisau dan hendaklah dia menyenangkan haiwan sembelihannya itu.\"<br><br>(Riwayat Ahmad no. 17154, Muslim no. 1955, Abu Daud no. 2815, al-Tirmizi, Ibn Majah no. 3170, al-Nasa’i no. 4405 dan al-Baihaqi no. 11071).<br><br><br><strong>Pokok Perbincangan Hadis:</strong><br><br>Syariat Islam menuntut perbuatan ihsan kepada setiap makhluk, contohnya dalam hukuman bunuh (qisas) atau ketika menyembelih haiwan.<br><br>Dalam hukuman bunuh, perlu tiada unsur penganiayaan, tidak menyegerakan kematian secara kasar, dan memancung tengkuk mengikut cara yang ditetapkan al-Quran dan hadis Nabi SAW. Mata pedang perlu ditajamkan terlebih dahulu sebelum digunakan.<br><br>Termasuk ihsan juga ialah berbuat baik terhadap haiwan ternak dan belas kasih kepadanya. Ketika menyembelih:<br><br>Segerakan kematian haiwan.<br><br>Gunakan mata pisau yang tajam.<br><br>Menyembelih dengan lembut, jangan merobohkan haiwan ke tanah dengan kasar atau menyeretnya.<br><br>Menghadapkannya ke kiblat, membaca basmalah dan hamdalah.<br><br>Memotong urat nadi leher secara serentak (halqum, marih, dan wudjin).<br><br>Biarkan haiwan mati dahulu sebelum dilapah.<br><br>Mensyukuri nikmat dan pemberian Allah, yang telah menundukkan haiwan untuk disembelih dan menghalalkan dagingnya untuk dimakan."
    },
    {
      "number": 18,
      "title": "Taqwa & Taubat",
      "arabicTitle": "",
      "imagePath": "assets/images/h18.jpg",
      "audioPath": "assets/audio/hadith18.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith18.png"
      ],
      "htmlDescription": "Daripada Abu Zar Jundub ibn Junadah dan Abu Abdul Rahman Mu'az ibn Jabal, r.a., daripada Rasulullah SAW, bahawa Baginda bersabda: \"Bertaqwalah engkau kepada Allah walaupun di mana engkau berada, dan iringilah kejahatan dengan kebaikan, nescaya ia akan menghapuskan kejahatan tersebut dan bergaullah sesama manusia dengan budi pekerti yang baik.\"<br><br>(Riwayat Ahmad no. 21392, al-Tirmizi no. 1988 dan al-Hakim no. 178).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Takwa kepada Allah adalah kewajiban setiap Muslim dan merupakan asas diterimanya amal soleh.<br><br>Bertaubat segera selepas melakukan keburukan adalah penting kerana taubat menghapus dosa-dosa besar. Perbuatan buruk hendaklah dibalas dengan kebaikan, contohnya memaafkan orang lain, kerana kebaikan akan menghapus keburukan.<br><br>Bersungguh-sungguh menghiasi diri dengan akhlak mulia dengan mencontohi akhlak Rasulullah SAW. Rasulullah SAW bersabda:<br><br>“Sesungguhnya aku diutuskan untuk menyempurnakan akhlak yang mulia.” (Riwayat al-Baihaqi no. 21301)<br><br>Menjaga batas pergaulan yang baik adalah kunci kejayaan, kebahagiaan, dan ketenangan di dunia dan akhirat."
    },
    {
      "number": 19,
      "title": "Tawakkal kepada Allah",
      "arabicTitle": "",
      "imagePath": "assets/images/h19.jpg",
      "audioPath": "assets/audio/hadith19.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith19.png"
      ],
      "htmlDescription": "Daripada Abu al-'Abbas, Abdullah ibn Abbas, r.a. beliau berkata: \"Aku pernah duduk di belakang Nabi SAW pada suatu hari, lalu Baginda bersabda kepadaku: “Wahai anak! Sesungguhnya aku mahu ajarkan engkau beberapa kalimah: Peliharalah Allah nescaya Allah akan memeliharamu. Peliharalah Allah nescaya engkau akan dapati Dia di hadapanmu. Apabila engkau meminta, maka pintalah dari Allah. Apabila engkau meminta pertolongan, maka mintalah pertolongan dengan Allah. Ketahuilah bahawa kalau umat ini berkumpul untuk memberikan sesuatu manfaat kepadamu, mereka tidak akan mampu memberikanmu manfaat kecuali dengan suatu perkara yang memang Allah telah tentukan untukmu. Sekiranya mereka berkumpul untuk memudharatkan kamu dengan suatu mudharat, nescaya mereka tidak mampu memudharatkan kamu kecuali dengan suatu perkara yang memang Allah telah tentukannya untukmu. Pena-pena telah diangkatkan dan lembaran-lembaran telah kering (dakwatnya).\"<br><br>(Riwayat Ahmad no. 2669, al-Tirmizi no. 2516 dan al-Hakim no. 6302).<br><br>Dalam riwayat selain Imam al-Tirmizi disebutkan:<br><br>“Jagalah Allah nescaya engkau mendapati-Nya di hadapanmu; kenalilah Allah pada waktu lapang nescaya Dia mengenalimu pada waktu kesusahan. Ketahuilah, bahawa apa yang luput daripadamu tidak bakal mengenaimu, dan apa yang mengenaimu tidak bakal luput daripadamu. Ketahuilah bahawa bersama kesabaran ada kemenangan; bersama kesusahan ada jalan keluar; dan bersama kesulitan ada kemudahan.”<br><br><strong>Pelajaran daripada hadis:</strong><br><br>Bertawakal kepada Allah akan membuatkan Allah memberikan kecukupan dan pertolongan.<br><br>(Firman Allah: “Dan sesiapa bertawakal kepada Allah, maka Allah pasti akan memberinya kecukupan.” – Surah At-Talaq 65:3)<br><br>Ciri menuntut ilmu ialah berusaha dengan penuh keinginan dan rasa ingin tahu.<br><br>Orang yang istiqamah melaksanakan perintah Allah akan dijaga oleh Allah di dunia dan akhirat.<br><br>Beramal soleh dan melaksanakan perintah Allah dapat mengelak daripada bencana dan mendapat pertolongan-Nya dalam kesulitan.<br><br>Hanya kepada Allah kita memohon pertolongan; jangan meminta daripada selain-Nya.<br><br>Musibah hanya berlaku berdasarkan ketetapan Allah, dan orang yang selalu bersyukur akan mendapat perhatian, pertolongan, dan perlindungan Allah.<br><br>Menghormati waktu dan menggunakannya untuk perkara bermanfaat, seperti Rasulullah SAW memanfaatkan masa ketika berkendaraan. Gunakan masa muda sebaik mungkin untuk menuntut ilmu yang bermanfaat."
    },
    {
      "number": 20,
      "title": "Sifat Malu",
      "arabicTitle": "",
      "imagePath": "assets/images/h20.jpg",
      "audioPath": "assets/audio/hadith20.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith20.png"
      ],
      "htmlDescription": "Daripada Abu Mas'uud 'Uqbah ibn 'Amru al-Ansarie al-Badrie r.a. beliau berkata: Rasulullah SAW telah bersabda: \"Sesungguhnya antara kata-kata ungkapan Kenabian terdahulu yang dapat diketahui dan dipetik oleh manusia ialah: Jika engkau tidak malu, maka lakukanlah apa sahaja yang engkau mahu.\"<br><br>(Riwayat al-Bukhari, no. 3296 dan Abu Daud, no. 4796).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Malu adalah tema yang telah disepakati oleh para nabi dan ajarannya tidak pernah terhapus.<br><br>Jika seseorang kehilangan rasa malu, maka jangan harap kebaikan darinya.<br><br>Malu merupakan landasan akhlak mulia dan selalu berpaksikan kebaikan. Semakin banyak rasa malu seseorang, semakin banyak kebaikannya, dan sebaliknya.<br><br>Rasa malu adalah perilaku yang boleh dibentuk, maka setiap orang yang bertanggungjawab hendaknya membimbing mereka yang di bawah tanggungannya.<br><br>Tidak ada rasa malu dalam mengajarkan hukum agama, menuntut ilmu, dan menyatakan kebenaran. Allah Ta’ala berfirman:<br><br>“Dan Allah tidak malu daripada menyatakan kebenaran.” (Surah al-Ahzab: 33:53)<br><br>Manfaat rasa malu termasuk ‘Iffah (menjaga diri daripada perbuatan tercela) dan Wafa’ (menepati janji).<br><br>Rasa malu adalah cabang iman yang wajib diamalkan. Rasulullah SAW bersabda:<br><br>“Malu itu sebahagian daripada iman.” (Riwayat al-Bukhari no. 24 dan Muslim no. 36)"
    },
    {
      "number": 21,
      "title": "Sifat Istiqamah",
      "arabicTitle": "",
      "imagePath": "assets/images/h21.jpg",
      "audioPath": "assets/audio/hadith21.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith21.png"
      ],
      "htmlDescription": "Daripada Abu `Amru - atau digelar juga Abu `Amrah - Sufian ibn Abdullah r.a. beliau berkata: \"Aku berkata: Wahai Rasulullah! Ajarkan untukku dalam Islam suatu ucapan yang aku tidak perlu lagi bertanya kepada orang lain selainmu. Baginda bersabda: Ucapkanlah: Aku beriman kepada Allah. Kemudian hendaklah engkau beristiqamah.\"<br><br>(Riwayat Muslim no. 38; al-Nasa’i no. 11489 dan Ibn Majah no. 3972).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Beriman kepada Allah Ta’ala hendaklah mendahului ketaatan.<br><br>Amal soleh dapat menjaga dan menguatkan keimanan.<br><br>Iman dan amal soleh harus dilaksanakan bersama-sama.<br><br>Istiqamah merupakan darjat yang tinggi dalam keimanan dan ketaatan.<br><br>Para sahabat memiliki keinginan kuat untuk menjaga agama dan meningkatkan keimanan mereka.<br><br>Allah berfirman:<br><br>“Maka hendaklah kamu beristiqamah seperti yang diperintahkan kepadamu.” (Surah Hud 11:112)<br><br>Perintah istiqamah dalam tauhid dan beribadah hanya kepada Allah hendaklah dijaga sepanjang hayat.<br><br>Allah berfirman:<br><br>“Sesungguhnya mereka yang berkata: Allah adalah Tuhan kami kemudian mereka istiqamah…” (Surah Fussilat 41:30)<br><br>Allah berfirman:<br><br>“Sesungguhnya orang yang menyatakan: Tuhan kami adalah Allah. Kemudian mereka tetap istiqamah, maka tidak ada kekhuatiran terhadap mereka dan tidak pula mereka berduka cita.” (Surah Ahqaf 33:13)<br><br>Umar bin Khattab berkata:<br><br>“Para sahabat istiqamah demi Allah dalam mentaati-Nya dan tidak sedikit pun mereka berpaling, walaupun seperti berpalingnya musang.”"
    },
    {
      "number": 22,
      "title": "Allah Maha Pemurah",
      "arabicTitle": "",
      "imagePath": "assets/images/h22.jpg",
      "audioPath": "assets/audio/hadith22.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith22.png"
      ],
      "htmlDescription": "Daripada Abu Abdullah Jabir ibn Abdullah al-Ansarie r.a., (beliau meriwayatkan): Bahawa seorang lelaki telah bertanyakan Rasulullah SAW, dia berkata: \"Bagaimana pandanganmu jika aku mendirikan sembahyang-sembahyang fardhu, aku berpuasa bulan Ramadhan, aku menghalalkan perkara yang halal dan aku mengharamkan perkara yang haram. Aku tidak akan menambah apa-apa lagi lebih daripada itu. Apakah aku akan masuk syurga?\" Baginda bersabda: \"Ya!\"<br><br>(Riwayat Ahmad dan Muslim, no. 15).<br><br><br><strong>Catatan:</strong><br><br>Yang bertanya ialah Nu’man bin Qauqal, seorang sahabat yang turut serta dalam perang Badar dan syahid dalam perang Uhud. Keimanannya terhadap syurga dan janji Allah mendorong beliau untuk bertanya kepada Nabi SAW tentang hadis ini.<br><br><strong>Pelajaran daripada hadis:</strong><br><br>Setiap Muslim dituntut bertanya kepada ulama tentang syariat Islam, kewajiban, dan apa yang halal atau haram jika perkara itu tidak diketahuinya.<br><br>Penghalalan dan pengharaman adalah aturan syariat; tiada sesiapa berhak menentukannya kecuali Allah Ta’ala.<br><br>Amal soleh adalah sebab seseorang masuk syurga.<br><br>Para sahabat menunjukkan keinginan dan perhatian yang besar terhadap syurga serta usaha mereka mencari jalan untuk mencapainya.<br><br>Hadis ini menjelaskan bahawa apabila seorang mukmin menunaikan semua tanggungjawab agama yang fardhu dengan sempurna, menghalalkan yang halal dan mengharamkan yang haram, dia akan masuk syurga walaupun tidak melakukan amalan sunat lain. Ini menunjukkan kemurahan dan rahmat Allah SWT terhadap hamba-hamba-Nya."
    },
    {
      "number": 23,
      "title": "Kebersihan dan Iman",
      "arabicTitle": "",
      "imagePath": "assets/images/h23.jpg",
      "audioPath": "assets/audio/hadith23.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith23.png"
      ],
      "htmlDescription": "Daripada Abu Malik al-Haris ibn `Asim al-Asya'arie r.a. beliau berkata: Rasulullah SAW telah bersabda: \"Kebersihan itu sebahagian daripada iman. Ucapan zikir al-Hamdulillah memenuhi neraca timbangan. Ucapan zikir Subhaanallah dan al-Hamdulillah kedua-duanya memenuhi ruangan antara langit dan bumi. Sembahyang itu adalah cahaya. Sedekah itu adalah saksi. Sabar itu adalah sinaran. Al-Qur'an itu adalah hujah bagimu atau hujah ke atasmu. Setiap manusia keluar waktu pagi, ada yang menjual dirinya, ada yang memerdekakan dirinya dan ada pula yang mencelakakan dirinya.\" (Riwayat Muslim no.223 dan al-Tirmizi no.3517).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Iman merupakan ucapan dan perbuatan; ia bertambah dengan amal soleh dan ketaatan serta berkurang dengan maksiat dan dosa.<br><br>Amal perbuatan akan ditimbang pada hari kiamat dan memiliki berat dan nilainya.<br><br>Bersuci adalah syarat sahnya ibadah, maka ia perlu diperhatikan.<br><br>Menjaga solat mendatangkan petunjuk, memperbaiki diri seorang Muslim, dan membezakan akhlak, perilaku, kewara’an, dan ketakwaannya.<br><br>Berinfaq di jalan kebaikan dan bersegera melakukannya merupakan petanda keimanan yang benar.<br><br>Dianjurkan bersabar ketika menghadapi musibah, terutama yang berlaku kerana perbuatan amar ma’ruf nahi munkar.<br><br>Membaca Al-Qur’an dengan pemahaman dan mentadabburi maknanya serta mengamalkan kandungannya dapat memberi syafaat pada hari kiamat.<br><br>Seorang Muslim harus menggunakan masa dan umurnya dalam ketaatan kepada Allah Ta’ala dan tidak mengabaikannya kerana kesibukan lain."
    },
    {
      "number": 24,
      "title": "Larangan Berlakunya Zalim",
      "arabicTitle": "",
      "imagePath": "assets/images/h24.jpg",
      "audioPath": "assets/audio/hadith24.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith24.png",
        "assets/images/hadith24_2.png"
      ],
      "htmlDescription": "Daripada Abu Zar al-Ghifari r.a. daripada Rasulullah SAW berdasarkan apa yang diriwayatkan oleh Baginda daripada Allah SWT bahawa Dia berfirman: \"Wahai hamba-hambaKu! Sesungguhnya aku mengharamkan ke atas diriKu kezaliman dan Aku jadikannya di kalangan kamu sebagai suatu perkara yang diharamkan, maka janganlah kamu saling zalim-menzalimi.\" \"Wahai hamba-hambaKu! Kamu semua sesat kecuali orang yang Aku hidayatkannya, maka hendaklah kamu meminta hidayat dariKu.\" \"Wahai hamba-hambaKu! Kamu semua lapar kecuali orang yang Aku beri makan, maka hendaklah kamu meminta makan daripadaKu nescaya Aku akan berikan kamu makan.\" \"Wahai hamba-hambaKu! Kamu semua telanjang kecuali orang yang Aku berikannya pakaian, maka hendaklah kamu meminta pakaian daripadaKu nescaya Aku akan berikan kamu pakaian.\" \"Wahai hamba-hambaKu! Sesungguhnya kamu bersalah siang dan malam dan Aku mengampunkan semua dosa, maka mintalah keampunan daripadaKu nescaya Aku akan ampunkan kamu.\" \"Wahai hamba-hambaKu! Selama-lamanya kamu tidak akan mampu memudharatkan Aku sehingga kamu boleh memudharatkan Aku.\" \"Wahai hamba-hambaKu! Dan selama-lamanya kamu tidak akan mampu memberi manfaat kepada Aku sehingga kamu boleh memberi manfaat kepada Aku.\" \"Wahai hamba-hambaKu! Sekiranya orang-orang yang terdahulu dan terkemudian dari kamu, manusia dan jin di kalangan kamu, sekiranya mereka semua mempunyai hati bertaqwa umpama hati orang yang paling bertaqwa di kalangan kamu, nescaya hal itu tidak menambahkan apa-apapun dalam kerajaanKu.\" \"Wahai hamba-hambaKu! Sekiranya orang-orang yang terdahulu dan terkemudian dari kamu, manusia dan jin di kalangan kamu, sekiranya mereka semua mempunyai hati jahat umpama hati orang yang paling jahat di kalangan kamu, nescaya hal itu tidak mengurang-cacatkan apa-apapun dalam kerajaanKu.\" \"Wahai hamba-hambaKu! Sekiranya orang-orang yang terdahulu dan terkemudian dari kamu, manusia dan jin di kalangan kamu, sekiranya mereka semua berhimpun di suatu tempat, lalu mereka meminta daripadaKu (iaitu meminta sesuatu pemberian), lantas Aku kurniakan setiap orang dari kalangan mereka permintaannya, nescaya hal itu tidak mengurangkan sedikitpun apa-apa yang ada di sisiKu kecuali umpama berkurangnya air laut apabila dicelupkan sebatang jarum.\" \"Wahai hamba-hambaKu! Bahawa sesungguhnya hanya amalan kamu yang Aku akan perhitungkannya bagi kamu, kemudian Aku sempurnakan pembalasannya. Maka barangsiapa yang mendapat kebaikan maka hendaklah dia memuji Allah dan barangsiapa yang mendapat selain kebaikan, maka janganlah dia mencela kecuali mencela dirinya sendiri.\"<br><br>(Riwayat al-Bukhari dalam al-Adab al-Mufrad dan Muslim no. 2577).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Menegakkan keadilan di antara manusia dan mengharamkan kezaliman adalah tujuan utama ajaran Islam.<br><br>Wajib bagi setiap orang untuk memudahkan jalan petunjuk dan memintanya daripada Allah Ta’ala.<br><br>Semua makhluk bergantung kepada Allah untuk kebaikan dan perlindungan daripada keburukan, baik dalam perkara dunia mahupun akhirat.<br><br>Pentingnya istighfar daripada dosa, kerana Allah Ta’ala pasti mengampuninya.<br><br>Makhluk lemah dan tidak mampu mendatangkan kebaikan atau keburukan tanpa izin Allah.<br><br>Setiap mu’min wajib bersyukur kepada Allah Ta’ala atas nikmat dan taufiq-Nya.<br><br>Allah Ta’ala menghitung semua perbuatan hamba-Nya dan akan membalasnya dengan adil.<br><br>Hadis ini memberi petunjuk untuk muhasabah (introspeksi diri) dan menyesali dosa-dosa yang dilakukan."
    },
    {
      "number": 25,
      "title": "Sedekah",
      "arabicTitle": "",
      "imagePath": "assets/images/h25.jpg",
      "audioPath": "assets/audio/hadith25.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith25.png"
      ],
      "htmlDescription": "Daripada Abu Zarr r.a. juga, (beliau meriwayatkan): Bahawa sebahagian sahabat Rasulullah SAW berkata kepada Nabi SAW: \"Wahai Rasulullah! Orang-orang kaya telah mendapat banyak pahala. Mereka sembahyang sebagaimana kami sembahyang, mereka berpuasa sebagaimana kami berpuasa dan mereka bersedekah dengan lebihan harta mereka.\" Baginda bersabda: \"Bukankah Allah telah menjadikan bagi kamu sesuatu yang kamu boleh bersedekah dengannya? Sesungguhnya dengan setiap kali tasbih itu adalah sedekah, setiap kali takbir itu adalah sedekah, setiap kali tahmid itu adalah sedekah, setiap kali tahlil itu adalah sedekah, menyuruh amar ma'aruf itu sedekah, menegah mungkar itu sedekah dan pada kemaluan seseorang kamupun adalah sedekah.\" Mereka bertanya: \"Ya Rasulullah! Adakah apabila salah seorang kami melepaskan syahwatnyapun dia beroleh pahala?\" Baginda bersabda: \"Bagaimana pandangan kamu kalau dia melepaskan syahwatnya pada tempat haram, adakah dia berdosa? Maka demikian jugalah apabila dia melepaskannya pada tempat yang halal, dia beroleh pahala.\"<br><br>(Riwayat Ahmad no. 21483 dan Muslim no. 1006).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Memiliki sikap bijak dalam menghadapi pelbagai keadaan dapat membawa khabar gembira bagi jiwa dan menenangkan perasaan.<br><br>Para sahabat berlumba-lumba untuk berbuat kebaikan dan meningkatkan amal soleh.<br><br>Keutamaan Allah Ta’ala sangat luas dan banyak pintu kebaikan dibuka bagi hamba-Nya.<br><br>Semua bentuk zikir adalah sedekah yang dikeluarkan seseorang untuk dirinya sendiri.<br><br>Bahkan menyalurkan syahwat kepada yang halal, seperti bersetubuh dengan isteri, juga termasuk sedekah.<br><br>Dianjurkan untuk meminta sesuatu yang memberi manfaat bagi seorang Muslim dan dapat meningkatkan derajatnya ke arah yang lebih baik."
    },
    {
      "number": 26,
      "title": "Setiap Anggota Sebagai Sedekah",
      "arabicTitle": "",
      "imagePath": "assets/images/h26.jpg",
      "audioPath": "assets/audio/hadith26.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith26.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a. beliau berkata: Rasulullah SAW telah bersabda: \"Setiap anggota badan manusia adalah sedekah baginya pada setiap hari apabila terbit matahari; engkau berlaku adil (iaitu mendamaikan) antara dua orang (iaitu dua orang yang berbalah) adalah sedekah, engkau membantu seseorang naik kenderaannya atau mengangkat barang-barangnya ke atas kenderaannya adalah sedekah, perkataan yang baik adalah sedekah, setiap langkah yang engkau hayunkan kaki pergi sembahyang adalah sedekah dan menghilangkan sesuatu bahaya di jalan raya adalah sedekah.\"<br><br>(Riwayat al-Bukhari no.2827 dan Muslim no. 1007 dan 1009).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Bersyukur kepada Allah Ta’ala setiap hari atas nikmat kesihatan dan anggota badan.<br><br>Allah menjadikan setiap anggota badan sebagai alat untuk bersyukur dan menolong hamba-Nya, serta menggunakannya untuk kebaikan.<br><br>Termasuk sedekah adalah menahan tangan dan lisan daripada menyakiti orang lain, serta menggunakannya untuk menunaikan hak-hak setiap Muslim.<br><br>Jasad juga mempunyai zakat, iaitu melalui perbuatan baik, bersedekah, dan banyak pintu kebaikan yang boleh dilakukan.<br><br>Dianjurkan untuk mendamaikan kedua belah pihak, tolong-menolong, mengucapkan kata-kata baik, berjalan menuju solat, dan membuang penghalang solat.<br><br>Dianjurkan untuk membersihkan sarana umum sebagai bentuk amal kebaikan.<br><br>Dianjurkan untuk menegakkan keadilan, kerana dengan keadilanlah langit dan bumi dijaga."
    },
    {
      "number": 27,
      "title": "Hati Tenang dan Gelisah",
      "arabicTitle": "",
      "imagePath": "assets/images/h27.jpg",
      "audioPath": "assets/audio/hadith27.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith27.png"
      ],
      "htmlDescription": "Daripada Nawas bin Sim’an radhiallahuanhu, dari Rasulullah shollallohu ‘alaihi wa sallam beliau bersabda: \"Kebaikan adalah akhlak yang baik, sedangkan dosa adalah segala hal yang mengusik jiwamu dan engkau tidak suka jika orang lain melihatnya.\"<br><br>(Riwayat Ahmad 4/228, al-Bukhari dalam al-Adab no.295 dan Muslim no. 2553).<br><br>Dan daripada Wabishah bin Ma’bad radhiallahuanhu dia berkata: Saya mendatangi Rasulullah Shallallahu’alaihi wasallam, lalu baginda bersabda: \"Apakah engkau datang untuk bertanyakan tentang kebaikan?\" Saya menjawab: \"Benar!\" Baginda bersabda: \"Mintalah fatwa kepada kamu sendiri. Kebaikan adalah apa-apa yang mententeramkan jiwa dan hati, sedangkan dosa adalah apa-apa yang mengusik jiwa dan meragukan hati, meskipun orang-orang memberi fatwa yang membenarkanmu.\"<br><br>(Riwayat Ahmad no. 18006 dan al-Darimi (2/249)).<br><br><br><strong>Pelajaran daripada hadis:</strong><br><br>Tanda perbuatan dosa ialah timbulnya keraguan dalam jiwa dan rasa tidak senang sekiranya perbuatan tersebut diketahui oleh orang lain.<br><br>Sesiapa yang ingin melakukan sesuatu perbuatan hendaklah bermuhasabah dan bertanya kepada dirinya sendiri terlebih dahulu.<br><br>Dianjurkan untuk berakhlak mulia, kerana akhlak yang baik merupakan unsur kebaikan yang sangat besar dalam Islam.<br><br>Hati seorang mukmin akan tenang dengan perkara yang halal dan akan berasa gelisah terhadap perkara yang haram.<br><br>Wajib melihat dan memahami hukum terlebih dahulu sebelum bertindak, serta memilih jalan yang paling dekat dengan takwa dan wara’.<br><br>Rasulullah SAW ketika menyampaikan nasihat kepada para sahabat sentiasa mengambil kira keadaan dan situasi mereka.<br><br>Antara sifat orang mukmin yang disebut oleh Allah dalam Surah al-Anfal ayat 2–4 ialah:<br><br>“Sesungguhnya orang-orang yang beriman itu ialah mereka yang apabila disebut nama Allah, gementarlah hati mereka; dan apabila dibacakan ayat-ayat-Nya kepada mereka, bertambahlah iman mereka, dan hanya kepada Tuhan mereka bertawakal. Mereka mendirikan solat dan menginfakkan sebahagian rezeki yang Kami kurniakan kepada mereka. Mereka itulah orang-orang yang benar-benar beriman.”<br><br>Abu Tha‘labah al-Khasyani r.a. bertanya kepada Rasulullah SAW tentang perkara halal dan haram. Baginda bersabda bahawa kebaikan (halal) ialah sesuatu yang menenangkan diri dan jiwa, manakala dosa ialah sesuatu yang menimbulkan kegelisahan dalam hati (Riwayat Imam Ahmad).<br><br>Wabisah bin Ma‘bad r.a. meminta Rasulullah SAW satu panduan agar dia tidak perlu bertanya kepada orang lain. Baginda bersabda:<br><br>“Mintalah fatwa daripada hatimu. Tinggalkan apa yang meragukanmu kepada apa yang tidak meragukanmu, walaupun manusia memberikan fatwa kepadamu.”<br><br>Hati akan tenang terhadap yang halal dan resah terhadap yang haram.<br><br>Wasiat Nabi Adam a.s.<br><br>(Diriwayatkan dalam Syarah al-Arba‘in al-Nawawiyyah)<br><br>Jika kamu ingin melakukan sesuatu perkara tetapi hatimu gelisah, maka janganlah diteruskan. Nabi Adam a.s. mengakui bahawa hatinya telah gelisah ketika hendak memakan buah khuldi.<br><br>Jika kamu ingin melakukan sesuatu, fikirkanlah kesudahannya. Sekiranya Nabi Adam a.s. memikirkan akibat perbuatannya, nescaya baginda tidak akan memakan buah tersebut.<br><br>Jika kamu ingin melakukan sesuatu perkara, berundinglah dengan orang yang berilmu dan arif. Sekiranya Nabi Adam a.s. berunding dengan para malaikat, tentu baginda akan ditegah daripada memakan buah yang terlarang itu."
    },
    {
      "number": 28,
      "title": "Dakwah dan Bida'ah",
      "arabicTitle": "",
      "imagePath": "assets/images/h28.jpg",
      "audioPath": "assets/audio/hadith28.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith28.png"
      ],
      "htmlDescription": "Daripada Abu Najih al-Irbad bin Sariah r.a berkata: Maksudnya: Rasulullah SAW menasihati kita dengan nasihat perpisahan yang menggetarkan hati dan membuatkan air mata jatuh bercucuran. Kami bertanya: “Wahai Rasulullah, nasihat itu seakan-akan nasihat yang terakhir, oleh itu berilah kami wasiat.” Nabi SAW bersabda: “Saya memberi wasiat kepadamu agar tetap bertakwa kepada Allah ‘Azza wa Jalla, mendengar dan taat walaupun yang mempertahankanmu adalah seorang hamba. Sesungguhnya, sesiapa antara kamu masih hidup nescaya bakal menyaksikan banyak perselisihan. Kerana itu, berpegang teguhlah kepada sunnahku dan sunnah Khulafa al-Rasyidin yang lurus. Dan berpeganglah kepada sunnah-sunnah itu dengan kuat dan jauhilah olehmu akan hal-hal baharu yang diada-adakan (bidaah) kerana sesungguhnya semua bidaah itu sesat. <br> <br>   (Riwayat Abu Daud no. 4607 dan al-Tirmizi no. 2678)<br><br><strong>Pelajaran daripada hadis:</strong><br><br>Nasihat Rasulullah SAW memberi kesan yang sangat mendalam dalam jiwa para sahabat. Hal ini menjadi teladan bagi para pendakwah agar menyampaikan dakwah dan nasihat dengan hikmah, ikhlas dan penuh keprihatinan.<br><br>Takwa kepada Allah merupakan perkara paling utama untuk disampaikan oleh seorang muslim kepada muslim yang lain. Selepas itu, diwajibkan taat kepada pemerintah selagi mana tidak diperintahkan kepada maksiat.<br><br>Kewajipan berpegang teguh kepada sunnah Nabi SAW dan sunnah Khulafa’ al-Rasyidin, kerana di dalamnya terdapat kemenangan dan kejayaan, khususnya ketika berlakunya perbezaan pendapat dan perpecahan dalam umat.<br><br>Hadis ini menunjukkan sunat memberi wasiat ketika berpisah, kerana padanya terdapat kebaikan dan kebahagiaan di dunia dan akhirat.<br><br>Larangan keras daripada mengadakan perkara baharu dalam agama (bid‘ah) yang tidak mempunyai sandaran dan landasan daripada al-Qur’an dan al-Sunnah.<br><br>Bid‘ah dari sudut syarak ialah perkara yang diada-adakan dalam urusan agama yang bercanggah dengan perintah Allah dan dalil-dalil syarak, sama ada dalil khusus atau umum. Bid‘ah seperti ini adalah tercela dan termasuk dalam maksud sabda Nabi SAW:<br><br>“Setiap bid‘ah itu adalah sesat.”<br><br>Bid‘ah dari sudut bahasa pula ialah sesuatu yang dicipta tanpa ada contoh sebelumnya. Dalam konteks ini, sebahagian sahabat memandang baik beberapa perkara yang bersifat baharu, seperti tindakan Sayidina Umar r.a. mengumpulkan orang ramai untuk solat tarawih secara berjemaah dengan seorang imam, lalu beliau berkata:<br><br>“Ini adalah sebaik-baik bid‘ah.”<br><br>Diriwayatkan bahawa Ubay bin Ka‘ab r.a. berkata kepada Sayidina Umar r.a.:<br><br>“Perkara ini tidak pernah dilakukan sebelum ini.”<br><br>Maka Umar r.a. menjawab:<br><br>“Aku mengetahuinya, namun ia adalah sesuatu yang baik.”<br><br>Imam al-Syafi‘i رحمه الله menjelaskan bahawa bid‘ah terbahagi kepada dua:<br><br>Bid‘ah yang tercela, iaitu perkara baharu yang bercanggah dengan al-Qur’an, al-Sunnah, athar dan ijmak.<br><br>Bid‘ah yang terpuji (hasanah), iaitu perkara baharu yang tidak bercanggah dengan al-Qur’an, al-Sunnah, athar dan ijmak, serta membawa kepada kebaikan."
    },
    {
      "number": 29,
      "title": "Menjaga Lidah",
      "arabicTitle": "",
      "imagePath": "assets/images/h29.jpg",
      "audioPath": "assets/audio/hadith29.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith29.png",
        "assets/images/hadith29_2.png"
      ],
      "htmlDescription": "Daripada Mu'az bin Jabal r.a berkata bahawa beliau bertanya Rasulullah SAW: \"Wahai Rasulullah, beritahulah kepadaku tentang suatu amal yang dapat memasukkanku ke dalam syurga dan menjauhkanku daripada neraka.\" Nabi SAW menjawab: \"Engkau bertanya tentang perkara yang besar namun sesungguhnya ia adalah mudah bagi orang yang dimudahkan oleh Allah SWT. Sembahlah Allah dan jangan menyekutukan-Nya dengan sesuatu pun, kerjakanlah solat, keluarkanlah zakat, berpuasalah pada bulan Ramadhan dan kerjakanlah ibadah Haji ke Baitullah.\"<br><br>Kemudian baginda bersabda: \"Inginkah engkau kuberi petunjuk akan pintu-pintu kebaikan?\" Puasa itu adalah sebagai perisai, sedekah adalah amal yang menghapuskan kesalahan sebagaimana air memadamkan api, dan solatnya seseorang di tengah malam. Kemudian Baginda membaca ayat pada surah Al-Sajdah, ayat 16-17: \"Mereka merenggangkan diri daripada tempat tidur (sedikit sangat tidur, kerana mengerjakan solat tahajud dan amal soleh) mereka sentiasa berdoa kepada Tuhan mereka dengan perasaan takut (akan murka-Nya) serta dengan perasaan ingin memperolehi lagi (keredhaan-Nya) dan mereka selalu menderma sebahagian daripada apa yang kami beri kepada mereka. Maka tidak ada seorang pun yang mengetahui satu persatu persediaan yang telah dirahsiakan untuk mereka (daripada segala jenis nikmat) yang amat indah dipandang dan mengembirakan, sebagai balasan bagi amal-amal soleh yang mereka telah kerjakan.”<br><br>Kemudian baginda bersabda: \"Mahukah engkau kuberitahu tentang pokok amal, tiang dan puncaknya?\" Saya menjawab: \"Mahu wahai Rasulullah!\" Rasulullah SAW bersabda: \"Pokok amal adalah Islam, tiangnya adalah solat, dan puncaknya adalah jihad.\"<br><br>Kemudian baginda bersabda: \"Mahukah engkau kuberitahu tentang kunci daripada semua perkara itu?\" Saya menjawab: \"Mahu wahai Rasulullah.\" Baginda lalu memegang lidahnya dan bersabda: \"Jagalah ini!\" Saya berkata: \"Wahai Nabi Allah, adakah kita dihisab atas apa yang kita katakan?\" Baginda bersabda: \"Semoga ibumu kehilanganmu! (ungkapan hairan). Tidak ada yang menjerumuskan orang ke dalam neraka melainkan hasil daripada ucapannya (yang berbentuk maksiat)?\"<br><br>(Hadis riwayat Ahmad no 22016 dan al-Tirmizi no 2619).<br><br><strong>Pengajaran Hadis:</strong><br><br>Berdasarkan hadis ini, amalan utama yang dapat memasukkan seseorang hamba ke dalam syurga ialah menunaikan rukun-rukun Islam, iaitu beriman kepada Allah tanpa mensyirikkan-Nya, beriman kepada Rasulullah SAW, mendirikan solat, menunaikan zakat, berpuasa pada bulan Ramadan dan menunaikan ibadah haji bagi yang mampu.<br><br>Pintu-pintu kebajikan amat luas dan banyak. Antara yang disebut dalam hadis ini ialah berpuasa, kerana puasa menjadi perisai yang menahan hawa nafsu seorang mukmin. Selain itu ialah sedekah yang ikhlas kerana Allah, yang mampu menghapuskan dosa sebagaimana air memadamkan api. Turut termasuk pintu kebajikan ialah solat pada waktu tengah malam (qiyamullail).<br><br>Ibadah pada waktu tengah malam merupakan ibadah yang sangat afdhal dan amat dituntut. Ia mampu menguatkan iman, keyakinan dan ketakwaan kepada Allah SWT, serta memberikan ketenangan jiwa dan sinar kebaikan pada wajah orang yang melakukannya. Allah SWT memuji orang-orang yang beribadah pada waktu malam dalam banyak ayat al-Qur’an, termasuk ayat yang disebut dalam hadis ini.<br><br>Asas segala urusan ialah Islam, tiangnya ialah solat, dan kemuncaknya ialah jihad. Seorang mukmin sejati hendaklah berusaha melaksanakan tuntutan-tuntutan ini dengan sebaik-baiknya walaupun berhadapan dengan pelbagai cabaran dan rintangan.<br><br>Kunci kepada segala kebaikan ialah menjaga lidah. Lidah merupakan antara anggota badan yang paling mudah terjerumus ke dalam maksiat. Sesiapa yang mampu menjaga lidahnya daripada perkataan keji, dusta dan dosa, Rasulullah SAW menjamin baginya jalan menuju syurga. Setiap perkataan yang diucapkan akan dipersoalkan oleh Allah SWT, dan ramai manusia dihumbankan ke neraka akibat tidak menjaga lidah mereka."
    },
    {
      "number": 30,
      "title": "Suruhan dan Larangan",
      "arabicTitle": "",
      "imagePath": "assets/images/h30.jpg",
      "audioPath": "assets/audio/hadith30.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith30.png"
      ],
      "htmlDescription": "Daripada Abi Tsa’labah al-Khusyani Jurtsumi bin Nasyirin r.a meriwayatkan daripada Rasulullah SAW, Baginda bersabda: \"Sesungguhnya Allah SWT telah menetapkan beberapa kewajipan, maka janganlah engkau meninggalkannya. Dan telah menentukan beberapa hudud (batas), maka janganlah engkau melampauinya. Dan telah mengharamkan beberapa perkara, maka janganlah melanggarinya. Dan Dia telah diam daripada beberapa perkara sebab rahmat bagimu, bukannya kerana lupa, maka janganlah engkau mempersoalkannya.\"<br><br>(Riwayat al-Baihaqi no.20217 dalam al-Sunan al-Kubra dan Abu Nu’aim dalam Hilyatul Auliya (9/17)).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Setiap mukmin diwajibkan mematuhi hukum Allah SWT, sama ada perintah yang berbentuk fardu mahupun larangan yang bersifat haram. Hadis ini mengingatkan agar setiap mukmin menjaga amalan fardu dengan sebaik-baiknya, tidak mempersiakannya atau meninggalkannya. Segala batasan yang telah ditetapkan oleh Allah SWT tidak boleh dilampaui.<br><br>Allah SWT telah menetapkan sempadan halal dan haram, maka setiap mukmin dituntut untuk benar-benar memeliharanya. Tidak dibenarkan mencabuli perkara yang haram, apatah lagi menghalalkan apa yang telah diharamkan oleh Allah.<br><br>Terdapat juga beberapa perkara yang tidak dijelaskan secara khusus hukum halal atau haramnya. Dalam hal ini, umat Islam tidak sepatutnya menyusahkan diri dengan pertanyaan yang berlebihan. Allah SWT mendiamkan perkara tersebut bukan kerana lupa, tetapi sebagai rahmat dan kemudahan kepada manusia. Hukum asal bagi perkara yang tidak dijelaskan halal atau haramnya ialah harus, iaitu boleh dilakukan.<br><br>Firman Allah SWT yang bermaksud:<br><br>“Wahai orang-orang yang beriman, janganlah kamu bertanya tentang perkara-perkara yang jika diterangkan kepada kamu akan menyusahkan kamu.”<br><br>(Surah al-Mā’idah 5:101)"
    },
    {
      "number": 31,
      "title": "Zuhud",
      "arabicTitle": "",
      "imagePath": "assets/images/h31.jpg",
      "audioPath": "assets/audio/hadith31.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith31.png"
      ],
      "htmlDescription": "Daripada Abi al-Abbas Sahl bin Sa’ad al-Sa’idi r.a berkata, bahawa seseorang datang kepada Nabi SAW seraya berkata: \"Wahai Rasulullah, tunjukkanlah saya suatu pekerjaan yang jika dikerjakan nescaya saya dicintai Allah dan dicintai umat manusia.\" Rasulullah SAW bersabda: \"Zuhudlah engkau akan dunia, nescaya Allah akan menyintaimu, dan zuhudlah engkau akan apa yang ada pada manusia, nescaya mereka mencintaimu.\"<br><br>(Riwayat Ibn Majah no. 4102 dan al-Baghawi dalam Syarhus Sunnah).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Hadis ini menerangkan satu sifat penting yang wajib ada pada setiap mukmin, iaitu sifat zuhud.<br><br>Dari segi bahasa, zuhud atau zahid bermaksud berpaling atau tidak cenderung kepada sesuatu kerana ia dianggap tidak bernilai.<br><br>Dari segi syarak, zuhud atau zahid bermaksud mengambil sekadar keperluan daripada perkara yang diyakini halal, tanpa berlebih-lebihan.<br><br>Warak pula bermaksud menjauhi perkara yang syubhah (tidak jelas hukumnya) kerana bimbang terjerumus ke dalam perkara yang haram.<br><br>Menurut para ulama tasawuf, zuhud terhadap dunia mempunyai beberapa maksud, antaranya:<br><br>Tidak terpaut hati kepada kemewahan dunia<br><br>Berpaling daripada cinta dunia<br><br>Menjauhkan hati daripada terlalu mengingati urusan dunia<br><br>Zuhud terhadap apa yang dimiliki orang lain bermaksud tidak iri hati atau cemburu terhadap harta dan kesenangan mereka, serta membersihkan hati daripada keinginan terhadap milik orang lain. Ia bukan bermaksud membenci atau berharap nikmat orang lain hilang, kerana itu termasuk sifat hasad yang dilarang.<br><br>Zuhud yang sebenar bukanlah meninggalkan dunia sepenuhnya atau hidup tanpa harta. Zuhud yang hakiki ialah tidak menjadikan dunia sebagai matlamat hidup, walaupun seseorang itu kaya. Contohnya para sahabat yang berharta seperti Abdul Rahman bin ‘Auf r.a., namun tujuan hidup mereka tetap untuk mencari keredhaan Allah SWT.<br><br>Rasulullah SAW bersabda yang bermaksud:<br><br>“Orang yang zuhud terhadap kesenangan dunia akan dilapangkan hatinya di dunia dan akhirat. Manakala orang yang mencintai dunia, hatinya akan sentiasa gelisah di dunia dan akhirat.”<br><br>Rasulullah SAW juga bersabda yang bermaksud:<br><br>“Sebaik-baik negeri ialah dunia bagi orang yang menjadikannya sebagai bekalan menuju akhirat dan mencari keredhaan Tuhannya. Dan seburuk-buruk negeri ialah dunia bagi orang yang menjauhkannya daripada akhirat dan keredhaan Tuhannya.”<br><br>Rasulullah SAW bersabda yang bermaksud:<br><br>“Kemuliaan seseorang itu terletak pada solat malamnya, dan kehormatannya ialah apabila dia tidak bergantung kepada manusia.”<br><br>Saidina Ali k.w.h berkata:<br><br>“Dunia ini adalah negeri kebenaran bagi orang yang berlaku benar padanya, negeri balasan bagi orang yang memahaminya, dan negeri bekalan bagi orang yang mengambil daripadanya persiapan menuju akhirat.”"
    },
    {
      "number": 32,
      "title": "Larangan Membuat Keburukan Kepada Orang Lain",
      "arabicTitle": "",
      "imagePath": "assets/images/h32.jpg",
      "audioPath": "assets/audio/hadith32.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith32.png"
      ],
      "htmlDescription": "Daripada Abi Sa’id bin Malik bin Sinan al-Khudri r.a berkata, bahawa Rasulullah SAW bersabda: \"Tidak boleh menimpakan bahaya (kepada orang yang tidak bersalah) dan menimpakan balasan yang membahayakan (melanggar syariat).\" Ada pula yang menggunakan: \"Tidak boleh menimpakan bahaya pada diri sendiri dan kepada orang lain.\"<br><br>(Riwayat Ahmad no.2867, Malik no.31, Ibn Majah no.2340,2341 dan al-Daruqutni no.(3/77)).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Jangan menzalimi diri sendiri atau orang lain.<br><br>Allah SWT berfirman melalui hadis riwayat Abu Dzar:<br><br>“Wahai hamba-Ku, sesungguhnya Aku telah mengharamkan diri-Ku daripada berbuat zalim dan menjadikan haram juga antara kamu, maka janganlah kamu saling menzalimi.”<br><br>Tunaikan amanah dan jangan khianat.<br><br>Nabi SAW bersabda:<br><br>“Tunaikanlah amanat kepada orang yang memberikan amanat kepadamu, dan janganlah kamu berkhianat kepada orang yang berkhianat.”<br><br>Jangan menzalimi diri sendiri.<br><br>Contohnya, hadis riwayat Anas: Rasulullah SAW melihat seorang lelaki yang hendak menunaikan nazarnya dengan berjalan kaki ke Mekah untuk haji. Baginda menegur bahawa:<br><br>“Allah tidak menghendaki perjalanannya, hendaklah dia menggunakan kenderaan.”<br><br>Maksudnya, jangan membebani diri sendiri dengan perkara yang tidak diwajibkan.<br><br>Agama itu mudah.<br><br>Nabi SAW menegaskan bahawa Islam tidak memberatkan, sebaliknya memberikan kemudahan bagi setiap umatnya dalam menunaikan perintah Allah.<br><br>Jangan memudaratkan orang lain walaupun untuk kebaikan diri sendiri.<br><br>Contohnya, membakar sampah di halaman sendiri sehingga asap mengganggu jiran. Islam menuntut setiap muslim menjaga hak orang lain dan tidak menzalimi mereka."
    },
    {
      "number": 33,
      "title": "Bukti dan Sumpah",
      "arabicTitle": "",
      "imagePath": "assets/images/h33.jpg",
      "audioPath": "assets/audio/hadith33.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith33.png"
      ],
      "htmlDescription": "Daripada Ibn Abbas r.a meriwayatkan, bahawa sesungguhnya Rasulullah SAW bersabda: \"Jika semua orang dipenuhi akan tuntutannya, nescaya akan ada orang menuntut harta benda dan darah suatu kaum. Akan tetapi hendaklah ada bukti bagi orang yang menuduh dan ada sumpah bagi yang mengingkari.\"<br><br>(Riwayat al-Baihaqi no 20990, hasan sebahagian lafaznya diriwayatkan oleh al-Bukhari no. 4552 dan Muslim no. 1711).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Seorang hakim harus meminta dari kedua pihak yang bersengketa bukti yang dapat menguatkan pengakuan mereka, seperti saksi yang memenuhi syarat-syaratnya.<br><br>Seorang hakim tidak boleh memutuskan perkara dengan cara menghalalkan yang haram atau mengharamkan yang halal.<br><br>Seseorang dianggap bebas dari tuduhan sehingga perbuatan jahatnya terbukti.<br><br>Seorang hakim harus berusaha keras untuk mengetahui masalah sebenar dan menjelaskan hukum berdasarkan apa yang nampak baginya.<br><br>Bersumpah hanya dibenarkan atas nama Allah.<br><br>Riwayat al-Bukhari dan Muslim: Ibn Abu Mulaikah berkata bahawa Ibn Abbas menulis bahawa Nabi SAW menetapkan sumpah untuk orang yang menyangkal tuduhan.<br><br>Nabi SAW bersabda:<br><br>“Sekiranya manusia dikabulkan apa sahaja yang menjadi pengakuannya, nescaya orang akan mudah menuntut darah dan harta orang lain. Akan tetapi, sumpah itu untuk orang yang menyangkal dakwaan.”<br><br>Maksudnya, sumpah digunakan untuk pihak yang menyangkal tuduhan, bagi memastikan keadilan ditegakkan."
    },
    {
      "number": 34,
      "title": "Amar Ma'ruf Nahi Mungkar",
      "arabicTitle": "",
      "imagePath": "assets/images/h34.jpg",
      "audioPath": "assets/audio/hadith34.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith34.png"
      ],
      "htmlDescription": "Daripada Abi Sa’id al-Khudri r.a berkata bahawa beliau mendengar Rasulullah SAW bersabda: \"Sesiapa antara kamu melihat kemungkaran hendaklah dia mengubah dengan tangannya; jika tidak sanggup maka dengan lisannya; dan jika tidak sanggup juga dengan hatinya. Itu adalah selemah-lemah iman.\"<br><br>(Riwayat Ahmad no. 11478, Muslim no. 49, Abu Daud no. 1140 dan al-Tirmizi no. 2172).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Menentang pelaku kejahatan dan menolak kemungkaran adalah kewajiban setiap Muslim, mengikut kemampuan dan kekuatan masing-masing.<br><br>Redha atau menerima kemaksiatan termasuk antara dosa-dosa besar.<br><br>Sabar menanggung kesusahan dalam amar ma’ruf dan nahi mungkar adalah penting.<br><br>Amal soleh adalah buah daripada iman; oleh itu, menolak kemungkaran juga merupakan tanda keimanan seseorang.<br><br>Mengingkari kemungkaran dengan hati wajib bagi setiap Muslim, manakala pengingkaran dengan tangan atau lisan dilakukan berdasarkan kemampuan.<br><br>\"Mengubah dengan tangan\" bermaksud menggunakan kuasa yang ada untuk membetulkan kemungkaran, tetapi bukan menggunakan kekerasan yang boleh menimbulkan pergaduhan, kekacauan, peperangan atau pertumpahan darah.<br><br>\"Mengubah dengan lisan\" dilakukan melalui perkataan, dakwah dan tunjuk ajar. Rasulullah SAW bersabda:<br><br>“Jihad yang utama ialah menyampaikan kebenaran kepada pemerintah yang zalim.” (Riwayat Ahmad no. 11159 daripada Abu Said r.a)<br><br>\"Mengubah dengan hati\" ialah dengan tidak bersetuju terhadap kemungkaran, menentang dan membencinya dalam hati.<br><br>Ibn Mas’ud berkata:<br><br>“Celakalah orang yang tidak mengetahui yang hak dan yang mungkar dalam hatinya.”"
    },
    {
      "number": 35,
      "title": "Dengki Memakan Kebaikan",
      "arabicTitle": "",
      "imagePath": "assets/images/h35.jpg",
      "audioPath": "assets/audio/hadith35.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith35.png"
      ],
      "htmlDescription": "Daripada Abi Hurairah r.a berkata bahawa Rasulullah SAW bersabda: \"Janganlah saling mendengki, saling menipu, saling membenci, saling membelakangi dan janganlah sebahagian kamu membeli barang yang telah dibeli oleh orang lain. Jadilah kamu hamba-hamba Allah yang bersaudara. Seorang Muslim adalah saudara bagi muslim yang lain. Dia tidak patut menzalimi, membohongi, dan merendahkannya. Takwa itu di sini (beliau menunjukkan dadanya tiga kali). Cukuplah seseorang dikatakan buruk jika sampai menghina saudaranya sesama setiap Muslim adalah haram bagi Muslim yang lain.\"<br><br>(Riwayat Ahmad no. 7713 dan Muslim no. 2563).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Dilarang bersifat dengki. Rasulullah SAW bersabda:<br><br>“Jauhilah sifat dengki kerana dengki memakan segala kebaikan seperti api memakan kayu.”<br><br>Dilarang berbuat keji atau menipu dalam urusan jual beli.<br><br>Dilarang membeli atau mengambil hak orang lain tanpa izin. Rasulullah SAW bersabda:<br><br>“Tidak dibenarkan seseorang menjual sesuatu yang telah dijual saudaranya, atau meminang yang telah dipinang saudaranya, kecuali dengan izinnya.” (Riwayat Ibn Umar)<br><br>Dilarang menghina sesama Muslim kerana sifat angkuh dan sombong boleh memadamkan kasih sayang sesama Islam. Rasulullah SAW bersabda:<br><br>“Kamu tidak akan masuk syurga sehingga kamu beriman. Dan tidak dikatakan kamu beriman sehingga kamu saling mengasihi. Mahu aku tunjukkan satu perkara yang apabila kamu lakukan, kamu akan saling mengasihi? Sebarkan salam di antara kamu.” (Riwayat Muslim no. 54)<br><br>Diharamkan memutuskan hubungan dengan sesama Muslim. Persaudaraan dan hak-haknya mesti dijaga kerana Allah Ta’ala.<br><br>Al-Razi (Yahya bin Mu’adh) berkata:<br><br>“Peliharalah tiga perkara dalam hubungan sesama Muslim: Pertama, jangan menyusahkan jika tidak dapat memberi manfaat. Kedua, jangan mendukakan jika tidak mahu menyukakan. Ketiga, jangan mencela jika tidak mahu memuji.”<br><br>Islam bukan sahaja tentang aqidah dan ibadah, tetapi juga meliputi akhlak dan urusan muamalah.<br><br>Hati merupakan sumber rasa takut dan tunduk kepada Allah Ta’ala.<br><br>Taqwa menjadi penanda keutamaan dan ukuran nilai seseorang Muslim.<br><br>Islam melarang semua akhlak tercela kerana ia memberi kesan negatif kepada masyarakat Muslim."
    },
    {
      "number": 36,
      "title": "Menutup Aib dan Mencari Ilmu",
      "arabicTitle": "",
      "imagePath": "assets/images/h36.jpg",
      "audioPath": "assets/audio/hadith36.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith36.png"
      ],
      "htmlDescription": "Daripada Abi Hurairah r.a meriwayatkan daripada Nabi SAW, Baginda bersabda: \"Sesiapa melepaskan salah satu kesusahan dunia daripada seorang Mukmin, maka Allah akan melepaskan salah satu kesusahan pada hari kiamat daripadanya. Sesiapa memudahkan orang yang tengah dilanda kesulitan maka Allah akan memudahkannya di dunia dan di akhirat. Sesiapa menutup aib seorang Muslim maka Allah akan menutup aibnya di dunia dan di akhirat. Allah menolong hamba-Nya selama hamba itu menolong saudaranya. Sesiapa menempuh suatu jalan dalam rangka mencari ilmu, maka Allah akan memudahkan baginya jalan menuju syurga. Tidaklah suatu kaum berkumpul di salah suatu rumah Allah dengan membaca kitab Allah dan mempelajarinya bersama-sama, kecuali bahawa ketenteraman akan turun kepada mereka, malaikat menaungi mereka di hadapan makhluk yang di sisi-Nya, dan sesiapa yang lambat (kurang) amalannya, maka tidak akan dipercepat mengangkat darjatnya.\"<br><br>(Riwayat Muslim no.2699, 2580 dan al-Tirmizi no. 2940).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Sesiapa yang membantu seorang Muslim menyelesaikan kesulitannya, Allah akan memudahkannya pada hari kiamat di hari yang paling sukar sebagai ganjaran atas kebaikannya.<br><br>Menutup aib dan malu seorang Muslim adalah amalan yang mulia. Allah akan menutup aib kita di akhirat sebagai balasannya.<br><br>Pembalasan di sisi Allah ta’ala sesuai dengan jenis perbuatan seseorang; baik dibalas dengan kebaikan, buruk dibalas dengan keadilan.<br><br>Berbuat baik kepada semua makhluk adalah salah satu cara untuk mendapatkan cinta dan keredaan Allah ta’ala.<br><br>Keikhlasan niat dalam menuntut ilmu amat penting supaya amal dan usaha kita tidak sia-sia.<br><br>Sentiasa memohon pertolongan dan kemudahan daripada Allah ta’ala kerana ketaatan hanya dapat dilaksanakan dengan pertolongan-Nya.<br><br>Membaca Al-Qur’an, memahaminya dan mengamalkan kandungannya adalah amalan yang digalakkan.<br><br>Keutamaan menuntut ilmu di rumah Allah (masjid) kerana ia memberi keberkatan dan peluang belajar yang lebih baik."
    },
    {
      "number": 37,
      "title": "Catatan Kebaikan dan Keburukan",
      "arabicTitle": "",
      "imagePath": "assets/images/h37.jpg",
      "audioPath": "assets/audio/hadith37.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith37.png",
        "assets/images/hadith37_2.png"
      ],
      "htmlDescription": "Daripada Ibn Abbas r.a meriwayatkan daripada Rasulullah SAW wahyu daripada Allah SWT yang berfirman: \"Sesungguhnya Allah menetapkan kebaikan-kebaikan dan keburukan-keburukan kemudian menerangkannya: Sesiapa berhasrat mengerjakan namun tidak jadi mengerjakannya, Allah mencatat di sisi-Nya satu kebaikan yang sempurna. Jika dia berhasrat mengerjakan kebaikan lalu benar-benar mengerjakannya, Allah mencatat nilai kebaikan itu sepuluh kali hingga tujuh ratus kali ganda, bahkan berlipat ganda lagi. Dan sesiapa berhasrat mengerjakan keburukan namun tidak jadi mengerjakannya, Allah mencatat di sisi-Nya satu kebaikan yang sempurna, dan jika dia berhasrat mengerjakan keburukan lalu benar-benar mengerjakannya, Allah hanya mencatat satu keburukan untuknya.\"<br><br>(Riwayat Ahmad no. 2828, al-Bukhari no. 6126 dan Muslim no. 131).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Kasih sayang Allah terhadap hamba-Nya yang beriman sangat luas, ampunan-Nya menyeluruh, dan pemberian-Nya tidak terbatas.<br><br>Allah tidak membebani manusia dengan sesuatu yang di luar kemampuan mereka; apa yang tidak mampu dilakukan, tidak akan diperhitungkan.<br><br>Allah tidak menghitung niat dan keinginan hati seseorang kecuali jika diikuti dengan amal perbuatan yang nyata.<br><br>Seorang Muslim hendaklah sentiasa berniat melakukan kebaikan dan membuktikannya dengan amal, supaya pahalanya ditulis dan dirinya siap melaksanakannya apabila peluang muncul.<br><br>Semakin besar keikhlasan seseorang, semakin banyak pahala dan ganjaran yang diperoleh.<br><br>Firman Allah SWT: “Barang siapa melakukan amal yang baik, maka baginya pahala sepuluh kali ganda amalnya.” (Surah al-An’am 6:160).<br><br>Firman Allah SWT: “Perumpamaan nafkah yang dikeluarkan oleh orang yang menafkahkan hartanya pada jalan Allah adalah seperti sebutir benih yang menumbuhkan tujuh tangkai, setiap tangkai seratus biji. Allah melipatgandakan ganjaran bagi siapa yang Dia kehendaki. Dan Allah Maha Luas kurnia-Nya lagi Maha Mengetahui.” (Surah al-Baqarah 2:261).<br><br>Rasulullah SAW bersabda: “Seorang lelaki datang membawa unta terikat dan berkata, ‘Ya Rasulullah, unta ini saya sedekahkan fi sabilillah.’ Rasulullah menjawab, ‘Kamu akan mendapat seratus ekor unta pada hari kiamat.’” (Riwayat Muslim daripada Ibn Mas’ud r.a).<br><br>Ibn Khalaf (Ibn Bathal) berkata: “Apabila Allah memendekkan umur umat Muhammad SAW, Dia menggantikan singkatnya umur itu dengan melipatgandakan pahala amal.”<br><br>Firman Allah SWT: “Dan sesiapa yang melakukan perbuatan jahat, maka dia akan dibalas setimpal dengan kejahatannya; mereka tidak akan dianiaya sedikit pun.” (Surah al-An’am 6:160).<br><br>Abu Darda’ berkata: “Sesiapa yang berniat melakukan qiamul-lail ketika hendak tidur, tetapi tidak terbangun hingga subuh, baginya tetap pahala kerana niatnya.”"
    },
    {
      "number": 38,
      "title": "Wali Allah",
      "arabicTitle": "",
      "imagePath": "assets/images/h38.jpg",
      "audioPath": "assets/audio/hadith38.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith38.png"
      ],
      "htmlDescription": "Daripada Abu Hurairah r.a berkata: Rasulullah SAW bersabda, bahawa Allah SWT berfirman: \"Sesiapa memusuhi wali-Ku, maka Kuizinkan dia diperangi. Tidaklah hamba-Ku mendekatkan diri kepada-Ku dengan sesuatu amal yang lebih Kusukai daripada jika dia mengerjakan amal yang Kuwajibkan kepadanya. Hamba-Ku sentiasa mendekatkan diri kepada-Ku dengan amalan-amalan sunah sehingga Aku mencintainya. Jika Aku mencintainya, jadilah Aku sebagai telinganya untuk mendengar dan sebagai matanya untuk melihat dan sebagai kakinya untuk berjalan dan jika dia meminta kepada-Ku pasti Kuberi dan jika dia meminta perlindungan kepada-Ku pasti Kulindungi.\"<br><br>(Riwayat al-Bukhari no. 6137 dan al-Baghawi jilid 7 halaman 204 dalam Syarhus Sunnah).<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Kedudukan seorang wali amat tinggi kerana dirinya selalu diarahkan dan dilindungi oleh Allah Ta’ala. Wali Allah ialah orang yang taat kepada-Nya. Allah SWT berfirman:<br><br>\"Ingatlah, sesungguhnya wali-wali Allah itu, tidak ada kekhuatiran terhadap mereka dan tidak pula mereka bersedih. Iaitu orang yang beriman dan selalu bertakwa.\" (Surah Yunus 10:62-63)<br><br>Melaksanakan perbuatan fardhu merupakan amalan yang dicintai Allah Ta’ala.<br><br>Sesiapa yang istiqamah dalam menunaikan sunnah dan menjauhi maksiat, akan meraih kecintaan Allah Ta’ala.<br><br>Apabila Allah Ta’ala mencintai seseorang, doanya akan dikabulkan oleh-Nya."
    },
    {
      "number": 39,
      "title": "Sengaja dan Tidak Sengaja",
      "arabicTitle": "",
      "imagePath": "assets/images/h39.jpg",
      "audioPath": "assets/audio/hadith39.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith39.png"
      ],
      "htmlDescription": "Daripada Ibn Abbas r.a berkata, bahawa sesungguhnya Rasulullah SAW bersabda:“Sesungguhnya Allah telah memaafkan (keranaku) daripada umatku amal-amal yang khilaf dan lupa dan dipaksakan atas mereka.”<br><br>(Riwayat Ibn Majah no. 2034, al-Baihaqi (10/60), al-Tabarani no. 765, al-Daraqutni (VII/170) dan al-Hakim (11/198))<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Allah Ta’ala mengutamakan umat ini dengan menghilangkan pelbagai kesulitan serta memaafkan kesalahan dan lupa.<br><br>Allah tidak menghukum seseorang kecuali jika dia sengaja melakukan maksiat dan hatinya berniat untuk menyimpang atau meninggalkan kewajiban secara sukarela.<br><br>Kewajiban diwujudkan untuk mengetahui siapa yang taat dan siapa yang membangkang perintah Allah.<br><br>Ada beberapa perkara yang tidak dimaafkan secara automatik. Contohnya, jika seseorang melihat najis pada bajunya tetapi mengabaikannya dan kemudian menunaikan solat kerana lupa, maka wajib baginya mengqada’ solat tersebut. Situasi sebegini banyak dijelaskan dalam kitab-kitab fiqh.<br><br>Ibn Hajar al-Haitami menyatakan bahawa hadis ini membawa manfaat yang menyeluruh kerana membicarakan tiga perkara yang sering ditemui dalam semua masalah fiqh.<br><br>Semua perbuatan manusia terbahagi kepada dua keadaan: sengaja dan tidak sengaja, termasuk kekeliruan, lupa, atau dipaksa.<br><br>Allah berfirman: “Jika kamu lahirkan apa yang ada di hati kamu atau kamu sembunyikan, maka Allah akan mengadili kamu berdasarkan perbuatanmu.” (Surah al-Baqarah 2:284)<br><br>Ayat ini membuat para sahabat merasa berat dan tertekan. Abu Bakar, Umar, Abdurrahman bin Auf dan Mu’adz bin Jabal serta beberapa sahabat lain datang kepada Rasulullah SAW.<br><br>Mereka berkata: “Kami dibebani dengan amal yang tak sanggup kami pikul. Dalam hati kami ada bisikan yang tidak kami sukai, walaupun bisikan itu menjanjikan dunia.”<br><br>Nabi SAW menjawab: “Boleh jadi kamu mengucapkan seperti Bani Israil, iaitu mahu mendengar tetapi menentangnya. Oleh itu katakanlah: ‘Kami mahu mendengar dan mentaati.’”<br><br>Hal ini membuat mereka tertekan dan diam. Lalu Allah memberikan kelonggaran dan rahmat-Nya:<br><br>Maksudnya: Allah tidak membebani seseorang melainkan sesuai dengan kemampuannya. Dia akan mendapat pahala atas usahanya dan akan ditanggungkan dosa atas kesalahannya. Lalu berdoalah: ‘Ya Tuhan kami, jangan Engkau hukum kami jika kami lupa atau bersalah.’ (Surah al-Baqarah 2:286)<br><br>Imam Baihaqi meriwayatkan bahawa Imam Syafi’i berkata:<br><br>“Allah berfirman: Kecuali orang yang dipaksa, sedangkan hatinya tenteram dengan imannya, maka orang ini tidak berdosa.”<br><br>Diampuni dosa bukan bermakna terbebas daripada tanggungjawab lain. Contohnya:<br><br>Seseorang yang tertembak kawan ketika berburu atau tertembak orang Islam semasa \tperang dengan orang kafir, tidak berdosa, tetapi wajib membayar kafarah.<br><br>Seseorang yang tertidur atau lupa menunaikan solat, tidak berdosa, tetapi wajib mengqada’ solatnya.<br><br>Seseorang yang dipaksa mengucapkan perkataan yang boleh menjadikannya murtad tetapi hatinya tetap beriman; jika dia menahan diri walaupun diseksa atau dibunuh, itu lebih mulia dan dianggap syahid."
    },
    {
      "number": 40,
      "title": "Ambil sekadar perlu",
      "arabicTitle": "",
      "imagePath": "assets/images/h40.jpg",
      "audioPath": "assets/audio/hadith40.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith40.png"
      ],
      "htmlDescription": "Daripada Ibn Umar r.a beliau berkata, bahawa Rasulullah memegang belakang beliau lalu bersabda:“’Janganlah engkau di dunia ini seakan-akan orang asing atau pengembara.’ Lalu Ibn Umar r.a berkata:‘Jika engkau telah berada di waktu petang, maka janganlah dinantikan waktu pagi. Jika engkau berada di waktu pagi, maka janganlah dinantikan waktu petang. Pergunakanlah waktu sihatmu sebelum waktu sakit dan waktu hidup sebelum mati.’”<br><br>(Riwayat al-Bukhari no. 6416 dan al-Tirmizi no. 2333)<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Imam Abul Hasan ‘Ali bin Khalaf dalam syarah Bukhari meriwayatkan bahawa Abu Zinad berkata:<br><br>“Hadis ini mengajak supaya sedikit bergaul dengan orang ramai dan lebih bersikap zuhud terhadap dunia.”<br><br>Abu Hasan menambah: “Orang yang asing biasanya jarang berkumpul dengan orang lain sehingga dia berasa terasing. Begitu juga seorang pengembara, dia hanya membawa bekalan yang secukupnya agar tidak terbeban dalam perjalanannya. Begitu juga seorang Mukmin dalam kehidupan dunia ini, hanya memerlukan bekal secukupnya untuk mencapai tujuan hidupnya, iaitu keredaan Allah dan kejayaan di akhirat.”<br><br>Rasulullah SAW kadang-kala menyentuh anggota badan orang yang dinasihat ketika menyampaikan ilmu atau amanat, sebagai kaedah pengajaran yang berkesan. Contohnya, Ibn Mas’ud berkata:<br><br>“Rasulullah SAW mengajarkan cara bertasyahud sambil memegang tapak tanganku.”<br><br>Dunia ini bersifat sementara, manakala akhirat kekal abadi. Firman Allah SWT:<br><br>Maksudnya: “Tiap-tiap yang bernyawa akan merasai mati.” (Surah Ali ‘Imran 3:185)<br><br>Dunia hanyalah jambatan untuk sampai ke akhirat. Allah SWT berfirman:<br><br>Maksudnya: “Kehidupan dunia ini tidak lain hanyalah kesenangan yang menipu daya.” (Surah Ali ‘Imran 3:185)<br><br>Gunakan peluang hidup untuk berbakti kepada Allah SWT. Rasulullah SAW bersabda:<br><br>“Manfaatkan lima perkara sebelum datang lima perkara lain: Masa muda sebelum tua, sihat sebelum sakit, kaya sebelum miskin, masa lapang sebelum sibuk, dan hidup sebelum mati.” (Riwayat al-Hakim daripada Ibn Umar r.a)<br><br>Segeralah melakukan kebaikan, banyakkan amal soleh, dan jangan menunda-nunda pekerjaan yang baik.<br><br>Bersikap zuhud terhadap dunia, tetapi bukan bermakna meninggalkan usaha. Berwaspadalah agar tidak melupakan akhirat.<br><br>Bersungguh-sungguh dalam melakukan amal soleh dan sentiasa takutkan azab Allah SWT.<br><br>Berwaspada terhadap orang yang berperilaku buruk agar tidak terpengaruh dengan perbuatan mereka."
    },
    {
      "number": 41,
      "title": "Melawan Hawa Nafsu",
      "arabicTitle": "",
      "imagePath": "assets/images/h41.jpg",
      "audioPath": "assets/audio/hadith41.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith41.png"
      ],
      "htmlDescription": "Daripada Abi Muhammad Abdillah bin ‘Amr bin al-‘Ash r.a, berkata, bahawa Rasulullah SAW bersabda: “Tidak beriman seseorang kamu sehingga hawa nafsunya mengikuti apa yang telah aku bawa (sampaikan).”<br><br>(Riwayat al-Hakim (4/164), al-Khatib (4/368) dan Ibn Abi Asim no. 15)<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Hadis ini selari dengan firman Allah SWT:<br><br>Maksudnya: “Demi Tuhanmu, mereka tidak dikatakan beriman sebelum mereka berhukum kepadamu mengenai perselisihan sesama mereka, mereka tidak berasa berat hati atas keputusan kamu serta menerima dengan pasrah sepenuhnya.” (Surah al-Nisa’ 4:65)<br><br>Salah satu sebab turunnya ayat ini adalah kerana berlaku perselisihan antara al-Zubair dengan seorang sahabat dari golongan Ansar mengenai masalah air. Kedua-duanya mengadukan perkara itu kepada Rasulullah SAW untuk mendapatkan penyelesaian. Nabi SAW bersabda kepada al-Zubair:<br><br>\"Wahai Zubair, alirkanlah dan tuangkanlah air kepada tetanggamu.\"<br><br>Namun, sahabat Ansar itu berkata: “Adakah kerana dia anak saudaramu?” Wajah Rasulullah SAW menjadi merah, kemudian Baginda bersabda:<br><br>\"Wahai Zubair, tutuplah alirannya sehingga air naik ke atas pagar, kemudian biarkan sehingga tumpah.\"<br><br>Perbuatan Nabi SAW itu memberi isyarat kepada al-Zubair bahawa keputusan tersebut mengandungi maslahat bagi golongan Ansar. Setelah memahami sabda Nabi SAW, Zubair menyedari hak dan kewajibannya.<br><br>Pengajaran daripada hadis dan kejadian ini:<br><br>Allah SWT menjadikan manusia sebagai makhluk yang sempurna.<br><br>Hawa nafsu manusia cenderung kepada keburukan dan sering mengabaikan syariat.<br><br>Manusia dimuliakan dengan akal yang dapat membezakan antara kebaikan dan keburukan.<br><br>Seseorang yang mengucapkan dua kalimah syahadah dan bertekad untuk taat syariat Allah SWT telah dikira beriman.<br><br>Untuk mencapai kesempurnaan iman, seseorang mesti mencintai apa yang dicintai Allah dan membenci apa yang dibenci-Nya serta sanggup berkorban demi Allah dan Rasul-Nya.<br><br>Setiap Muslim hendaklah berhukum dengan hukum Allah SWT.<br><br>Reda sepenuhnya dengan ketentuan Allah dalam semua perkara, walaupun keputusan itu tidak selari dengan hawa nafsu.<br><br>Mencintai apa yang dibenci Allah dan membenci apa yang dicintai-Nya adalah tanda kekufuran.<br><br>Para sahabat Rasulullah SAW menjadi contoh terbaik dalam mencintai Allah SWT dan Rasul-Nya.<br><br>Setiap Muslim mesti menyesuaikan perbuatannya dengan al-Quran dan al-Sunnah.<br><br>Seseorang yang mengakui kebenaran syariat Allah dengan hati dan lisan tetapi perbuatannya bertentangan dengan syariat, maka ia tergolong dalam golongan fasiq.<br><br>Seseorang yang perbuatannya sesuai syariat, tetapi hatinya menolak kebenaran syariat Allah, maka ia tergolong orang munafik.<br><br>Sesiapa yang memperlakukan hukum Allah sesuka hati, maka ia tergolong orang zindiq.<br><br>Keimanan juga meliputi membela dan mempertahankan syariat Allah SWT."
    },
    {
      "number": 42,
      "title": "Mencari Keampunan Allah",
      "arabicTitle": "",
      "imagePath": "assets/images/h42.jpg",
      "audioPath": "assets/audio/hadith42.mp3",
      "bismillahImagePath": "assets/images/bismillah.png",
      "hadithImages": [
        "assets/images/hadith42.png"
      ],
      "htmlDescription": "Daripada Anas bin Malik r.a berkata, bahawa dia mendengar Rasulullah SAW bersabda, bahawa Allah SWT berfirman:”Wahai anak Adam, selagi engkau meminta dan berharap kepada-Ku maka Aku mengampuni segala dosamu yang telah lalu, dan Aku tidak akan mempedulikannya. Wahai anak Adam, jika dosamu sampai setinggi langit lalu engkau minta ampun kepada-Ku nescaya Kuampuni. Wahai anak Adam, jika engkau datang kepada-Ku dengan kesalahan seluas permukaan bumi lalu engkau menemui-Ku tanpa menyekutukan sesuatu pun dengan-Ku, nescaya Aku datang padamu dengan ampunan seluas bumi pula.”<br><br>(Riwayat al-Tirmizi no: 3534 dan al-Baghawi dalam Syarhus Sunnah)<br><br><br><strong>Pengajaran Hadis:</strong><br><br>Daripada Abu Ayyub r.a., ketika hendak wafat, beliau berkata:<br><br>\"Saya pernah merahsiakan sesuatu daripada kamu yang saya dengar daripada Rasulullah SAW, iaitu Baginda bersabda: 'Sekiranya kamu semua tidak berbuat dosa, nescaya Allah akan menggantikannya dengan makhluk lain yang berbuat dosa, lalu Allah memberi keampunan kepada mereka.'”<br><br>Dalam sabda lain, Nabi SAW bersabda maksudnya:<br><br>\"Allah lebih bergembira dengan taubat seorang hamba-Nya daripada kegembiraan seorang \tdaripada kamu apabila menemui haiwan peliharaannya yang hilang.\"<br><br>Sentiasa berdoa dengan penuh harapan, khusyuk, fokus, patuh, yakin, dan tidak terburu-buru, sambil memastikan rezeki diperoleh dari sumber yang halal.<br><br>Allah Maha Berkuasa dan mampu memberi yang lebih baik daripada apa yang kita pinta.<br><br>Berdoalah dengan mematuhi adab-adab berdoa yang diajar oleh Rasulullah SAW.<br><br>Memohon keampunan walaupun dosa yang dilakukan kecil.<br><br>Istighfar hendaklah disertai dengan taubat yang sungguh-sungguh.<br><br>Sentiasa berbaik sangka dengan Allah SWT dalam setiap perkara.<br><br>Teguh dalam tauhid, sentiasa menyembah Allah sahaja dan menjauhi syirik."
    }
  ]
}