{
    "kata-kata-hikmah": [
        "Dan kepunyaan Allah-lah timur dan barat, maka kemanapun kamu menghadap di situlah wajah Allah. -2:115-",
        "Wahai orang-orang yang beriman! Taatlah kepada Allah dan Rasulnya dan janganlah kamu berpaling daripadanya, sedang Kamu mendengar. (Al-Quran yang mewajibkan taatnya). -Al-Anfaal:20-",
        "Janganlah bersedih, sesungguhnya Allah bersamamu",
        "Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya",
        "Sesungguhnya setiap kesulitan pasti ada kemudahan",
        "Adakah benda-benda dari bumi yang mereka jadikan tuhan-tuhan itu, dapat menghidupkan semula sesuatu yang mati? -21:21-",
        "Wahai manusia! <br> Sungguh, telah Kami datangkan kepadamu pelajaran (Al-Quran) dari Tuhanmu... <br> Penawar bagi penyakit yang ada di dalam dada... <br> Dan petunjuk serta rahmat bagi orang yang beriman -10:57-",
        "Jika engkau telah berazam, maka bertawakkallah kepada Allah",
        "Bukankah tiada balasan bagi amal yang baik melainkan kebaikan? -55:60-",
        "Maka yang mana satu nikmat-nikmat Tuhanmu yang kamu dustakan?  -55:13-",
        "Dan kami telah menjadikan kamu berpasang-pasangan -78:8-",
        "Sesungguhnya Tuhanmu tetap mengawas dan membalas, (terutama balasan akhirat) -89:14-",
        "Dan janganlah engkau mendekati zina, sesungguhnya ia adalah satu perbuatan yang keji dan suatu jalan yang buruk -17:32-",
        "Maka adakah patut kamu menyangka bahawa Kami hanya menciptakan kamu (dari tiada kepada ada) sahaja dengan tiada sebarang hikmat pada ciptaan itu? Dan kamu (menyangka pula) tidak akan dikembalikan kepada Kami? -23:115-",
        "Sesungguhnya orang-orang yang takut (melanggar hukum) Tuhannya semasa mereka tidak dilihat orang dan semasa mereka tidak melihat azab Tuhan, mereka beroleh keampunan dan pahala yang besar. -67:12-",
        "Sesungguhnya Allah tidak memberikan petunjuk kepada kaum yang berlaku zalim -AlMaidah:51-",
        "Kecuali orang yang bertaubat, beriman dan melakukan kebaikan, maka mereka itu akan masuk syurga dan tidak dizalimi (kehidupan) sedikitpun <br> -19:60-",
        "Jika kamu bersyukur pasti akan Aku tambah (nikmat-Ku) untukmu dan jika kamu kufur maka sesungguhnya siksa Ku amat pedih -Ibrahim:7-",
        "Dan orang-orang yang berkata, \"Wahai Tuhan kami! Kurniakanlah kepada kami isteri-isteri dan keturunan yang menyenangkan hati. Dan jadikanlah kami imam (pemimpin) bagi orang-orang yang bertaqwa.\" -25:74-",
        "Hai manusia, sesungguhnya telah datang kepadamu bukti kebenaran dari Rabb-mu. (Muhammad dengan mukjizatnya) dan telah Kami turunkan kepadamu cahaya yang terang benderang (Al-Quran) - An-Nisa : 174 -",
        "\"Wahai orang-orang yang beriman, makanlah rezeki yang baik kami berikan kamu dan bersyukurlah kepada Allah jika kamu hanya menyembah kepada-Nya.\" <br> -Albaqarah:172-",
        "Jika ada orang yang mencacimu dengan aib yang ia ketahui ada padamu. Jangan kamu balas dengan mencacinya dengan aib yang kamu ketahui ada padanya. Kerana pahalanya untukmu dan dosanya untuk dia. -HR. Ahmad-",
        "Orang-orang yang beriman dan hati mereka menjadi tenteram dengan berzikir (mengingati) Allah. Ingatlah, hanya dengan mengingati Allah, hati menjadi tenteram.",
        "Wahai hamba-hambaKu yang melampui batas terhadap diri mereka sendiri... Janganlah kalian berputus asa dari rahmat Allah... Sesungguhnya Allah mengampuni dosa-dosa semua-nya. Sesungguhnya Dialah Yang Maha Pengampun... lagi Maha Penyayang - Az-Zumar : 53 -",
        "Kemudian datanglah selepas mereka, pengganti yang mengabaikan solat dan mengikut keinginannya, maka kelak mereka akan tersesat <br> -19:59-",
        "Dan bagi orang-orang yang kufur ingkar terhadap Tuhan mereka, disediakan azab neraka Jahannam, dan itulah seburuk-buruk tempat kembali. -67:6-"

    ]
}