{
    "kata_kata_hikmah": [
      {
        "nombor": 1,
        "sumber": "Al-Qur'an (Q.S. Al-Insyirah: 6)",
        "kutipan": "Sesungguhnya sesudah kesulitan itu ada kemudahan."
      },
      {
        "nombor": 2,
        "sumber": "Al-Qur'an (Q.S. Al-Baqarah: 286)",
        "kutipan": "Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya."
      },
      {
        "nombor": 3,
        "sumber": "Al-Qur'an (Q.S. Al-Hujurat: 13)",
        "kutipan": "Sesungguhnya orang yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa di antara kamu."
      },
      {
        "nombor": 4,
        "sumber": "Al-Qur'an (Q.S. Al-Baqarah: 152)",
        "kutipan": "Maka berzikirlah (ingatlah) kepada-Ku nescaya Aku akan ingat kepadamu."
      },
      {
        "nombor": 5,
        "sumber": "Al-Qur'an (Q.S. An-Nahl: 127)",
        "kutipan": "Dan bersabarlah (wahai Muhammad) dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah."
      },
      {
        "nombor": 6,
        "sumber": "Umar bin Khattab r.a.",
        "kutipan": "Orang yang paling aku sukai adalah dia yang menunjukkan kesalahanku."
      },
      {
        "nombor": 7,
        "sumber": "Abu Bakar Ash-Shiddiq r.a.",
        "kutipan": "Apabila engkau telah berniat maka bertawakkallah kepada Allah."
      },
      {
        "nombor": 8,
        "sumber": "Ali bin Abi Thalib r.a.",
        "kutipan": "Hati manusia itu seperti bekas, ia akan terisi dengan apa yang engkau isikan ke dalamnya."
      },
      {
        "nombor": 9,
        "sumber": "Utsman bin Affan r.a.",
        "kutipan": "Jika engkau menginginkan kedamaian, bersedekahlah dengan kelebihan rezekimu, dan jika engkau menginginkan ketenangan, berdamailah dengan orang yang memusuhimu."
      },
      {
        "nombor": 10,
        "sumber": "Ali bin Abi Thalib r.a.",
        "kutipan": "Ilmu itu lebih baik daripada harta. Ilmu menjagamu, sedangkan engkau menjaga harta."
      },
      {
        "nombor": 11,
        "sumber": "Nabi Muhammad ﷺ",
        "kutipan": "Tinggalkanlah apa yang meragukanmu kepada apa yang tidak meragukanmu."
      },
      {
        "nombor": 12,
        "sumber": "Nabi Muhammad ﷺ",
        "kutipan": "Amal yang paling dicintai Allah adalah yang paling terus-menerus (rutin), meskipun sedikit."
      },
      {
        "nombor": 13,
        "sumber": "Imam Syafi'i",
        "kutipan": "Barang siapa yang tidak mampu menahan lelahnya belajar, maka ia harus menanggung pahitnya kebodohan."
      },
      {
        "nombor": 14,
        "sumber": "Imam Hasan Al-Basri",
        "kutipan": "Dunia ini adalah tempat menanam, sedangkan akhirat adalah tempat menuai."
      },
      {
        "nombor": 15,
        "sumber": "Nabi Muhammad ﷺ",
        "kutipan": "Kezaliman akan mengakibatkan kegelapan pada hari Kiamat."
      },
      {
        "nombor": 16,
        "sumber": "Imam Syafi'i",
        "kutipan": "Janganlah engkau mencintai orang yang tidak mencintai Allah, karena jika dia meninggalkan Allah, dia akan meninggalkanmu."
      },
      {
        "nombor": 17,
        "sumber": "Nabi Muhammad ﷺ",
        "kutipan": "Berdoalah dengan penuh keyakinan akan dikabulkan, dan ketahuilah bahwa Allah tidak mengabulkan doa dari hati yang lalai dan main-main."
      },
      {
        "nombor": 18,
        "sumber": "Imam Syafi'i",
        "kutipan": "Waktu laksana pedang, jika kamu tidak menggunakannya, maka ia akan memotongmu."
      },
      {
        "nombor": 19,
        "sumber": "Ibnul Qayyim Al-Jauziyyah",
        "kutipan": "Janganlah engkau bersedih atas apa yang telah berlalu, tetapi bersedihlah jika waktu berlalu tanpa ada amal kebaikan yang engkau lakukan."
      },
      {
        "nombor": 20,
        "sumber": "Imam Ahmad bin Hanbal",
        "kutipan": "Perbaikilah hubunganmu dengan Allah, nescaya Allah akan memperbaiki hubunganmu dengan manusia."
      },
      {
        "nombor": 21,
        "sumber": "Imam Al-Ghazali",
        "kutipan": "Kebahagiaan itu terletak pada empat hal: Ilmu, amal, kekayaan, dan kesabaran."},
        {
          "nombor": 22,
          "sumber": "Imam Al-Ghazali",
          "kutipan": "Jadikanlah kematian sebagai renungan yang menyibukkan hatimu daripada kesibukan dunia."
        },
        {
          "nombor": 23,
          "sumber": "Imam Al-Ghazali",
          "kutipan": "Hati adalah bekas Allah di bumi. Oleh karena itu, isilah ia hanya dengan yang dicintai-Nya."
        },
        {
          "nombor": 24,
          "sumber": "Imam Al-Ghazali",
          "kutipan": "Tinggalkanlah dosa, karena dosa akan mematikan hati dan merusak akal."
        },
        {
          "nombor": 25,
          "sumber": "Imam Al-Ghazali",
          "kutipan": "Sesungguhnya, tidak ada seorang pun yang akan mencapai darjat wali Allah kecuali dengan menjauhi apa yang disukai hawa nafsunya."
        },
        {
          "nombor": 26,
          "sumber": "Jalaluddin Rumi",
          "kutipan": "Jangan bersedih. Apa pun yang hilang darimu akan kembali dalam bentuk yang lain."
        },
        {
          "nombor": 27,
          "sumber": "Jalaluddin Rumi",
          "kutipan": "Tugasmu bukanlah mencari cinta, tetapi hanya mencari dan menemukan semua penghalang di dalam dirimu yang telah kamu bangun untuk melawannya."
        },
        {
          "nombor": 28,
          "sumber": "Jalaluddin Rumi",
          "kutipan": "Luka adalah tempat cahaya masuk ke dalam dirimu."
        },
        {
          "nombor": 29,
          "sumber": "Jalaluddin Rumi",
          "kutipan": "Kemarin saya pintar, jadi saya ingin mengubah dunia. Hari ini saya bijaksana, jadi saya mengubah diri saya sendiri."
        },
        {
          "nombor": 30,
          "sumber": "Jalaluddin Rumi",
          "kutipan": "Cahaya yang kita cari ada di dalam diri kita."
        }
      ]
    }